{
    "acModifier": "DEX",
    "armorProficiencies": [],
    "attacksByLevel": [],
    "baseAc": 10,
    "classWeapon": {
        "abilityName": "Strength",
        "damageType": "Bludgeoning",
        "diceAmount": 1,
        "diceTypeName": "D4",
        "name": ""
    },
    "effectiveCasterLevel": "PARENT",
    "features": [
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "You learn the esoteric rite Rite of the Dawn (detailed below).\n\nRite of the Dawn. Your rite damage is radiant type. The damage you suffer from activating this rite is halved.\n\nIf you hit an Undead creature with your Rite of the Dawn, it suffers additional radiant damage equal to your Wisdom modifier",
                        "level": 3
                    },
                    {
                        "description": "You learn the esoteric rite Rite of the Dawn (detailed below).\n\nRite of the Dawn. Your rite damage is radiant type. The damage you suffer from activating this rite is halved.\n\nIf you hit an Undead creature with your Rite of the Dawn, it suffers additional radiant damage equal to your Wisdom modifier.\n\nUpon reaching 11th level, any creature you hit with your Rite of the Dawn suffers this additional radiant damage",
                        "level": 11
                    }
                ],
                "id": "Customac882277-c7ce-4dde-9e29-052d2b97bae3",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Rite of the Dawn",
                "notes": "",
                "type": "Feat"
            },
            "level": 3
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "Your blood curses become honed to the fabric of a creature’s essence. Your blood curses can now affect any creature, regardless of their form or lack of blood.\n\nIn addition, when you amplify a use of your Blood Maledict feature, after rolling the amplify damage you would sustain, you may choose to reroll the die and must use the new roll",
                        "level": 7
                    }
                ],
                "id": "Customca14a1c0-6c47-46bc-91ac-407acfb6dff0",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Hallowed Veins",
                "notes": "",
                "type": "Feat"
            },
            "level": 7
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "You’ve learned to briefly step into the spirit world, enabling a swift and deadly strike. When you use the Attack action on your turn, you can expend a use of this feature to attack three times, instead of twice, and you temporarily become spectral. Until the end of your next turn, you can move through other creatures and objects as if they were difficult terrain. You take 1d10 force damage if you end your turn inside an object. If you are inside an object when you are no longer spectral, you are immediately shunted to the nearest unoccupied space that you can occupy and take force damage equal to twice the number of feet you moved. You may expend a use of this feature as a bonus action instead of making an attack.\n\nYou can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a short or long rest",
                        "level": 11
                    }
                ],
                "id": "Custom51266815-0948-4621-b6eb-3204b9e29329",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Supernal Surge",
                "notes": "",
                "type": "Feat"
            },
            "level": 11
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "You can see through magical darkness up to 30 feet, as well as see invisible creatures and objects up to 30 feet",
                        "level": 15
                    }
                ],
                "id": "Custom9cf0e3e3-b3c2-47fa-b116-8f88f6337c7d",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Gravesight",
                "notes": "",
                "type": "Feat"
            },
            "level": 15
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "You learn to project your spirit to fight on while on the edge of death. Whenever your hit points drop to 0, you can choose to let your soul emerge from your body to fight on. Your body remains unconscious and subject to death saving throws per normal. At the beginning of your next turn, you manifest a spirit form in your space that picks up your weapons and continues fighting on, acting on your turn and every one of your subsequent turns under your control. Your spirit form has your physical attributes and armor class, as well as your weapons and ammunition, and can move through other creatures and objects as if they were difficult terrain. This form is immune to cold, necrotic, and non-magical weapon damage. Your spirit form has access to all of your abilities and suffers no damage from your Crimson Rite feature.\n\nIf your spirit form takes any damage, your body dies, or you regain any hit points, your spirit form vanishes. If your spirit form vanishes, it drops your weapons in its space",
                        "level": 18
                    }
                ],
                "id": "Customedd3898f-ba75-4afa-81b6-36a18a2b4c82",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Vengeful Spirit",
                "notes": "",
                "type": "Feat"
            },
            "level": 18
        }
    ],
    "hpModifier": "CON",
    "id": "blood_hunter_order_of_the_ghostslayer",
    "jsonType": "class",
    "languages": [],
    "modelType": "Archetype",
    "multiclassArmor": true,
    "multiclassSkills": true,
    "multiclassTools": true,
    "multiclassWeapons": true,
    "name": "Order of the Ghostslayer",
    "selectableFeatures": [],
    "shouldShowCompanion": false,
    "skillProficiencies": [],
    "specialAbilities": [],
    "spellSlots": [],
    "spellcastingAbility": "WIS",
    "spells": [],
    "subtypes": [],
    "toolProficiencies": [],
    "weaponProficiencies": []
}