{
  "acModifier": "Dexterity",
  "armorProficiencies": [],
  "attacksByLevel": [],
  "baseAc": 10,
  "classWeapon": {
    "abilityName": "Strength",
    "damageType": "Bludgeoning",
    "diceAmount": 1,
    "diceTypeName": "D4",
    "name": ""
  },
  "effectiveCasterLevel": "PARENT",
  "features": [
    {
      "feat": {
        "descriptionModels": [
          {
            "description": "You've created a star map as part of your study of the heavens. The map is a Tiny object and can serve as a spellcasting focus for your druid spells. You decide what form the object takes, or you can determine what it is by rolling on the Star Map table.\n\nd6 --> Map Form\n1 --> A scroll of living wood that aligns with heavenly bodies\n2 --> A stone tablet with fine holes drilled through it\n3 --> A speckled owlbear hide, tooled with raised marks\n4 --> A collection of maps bound in an ebony cover\n5 --> A crystal that projects stars patterns when placed before a light \n6 --> Tempered glass disks that align to depict constellations\n\nIf you lose your map, you can perform a 1-hour ceremony to magically create a replacement.\n\nThis ceremony can be performed during a short or long rest, and it destroys the previous map.\n\nYou can cast the augury and guiding bolt spells without expending a spell slot and without preparing the spell, provided you use the star map as the spellcasting focus. You can cast a spell from the map in this way a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a long rest.",
            "level": 2
          }
        ],
        "id": "Custom171f27fd-fa18-475a-84ce-c00709692f92",
        "isFeature": true,
        "jsonType": "feat",
        "level": 1,
        "name": "Star Map",
        "notes": "",
        "type": "Feat"
      },
      "level": 2
    },
    {
      "feat": {
        "descriptionModels": [
          {
            "description": "You gain the ability to harness constellations' power to alter your form. As an action, you can expend a use of your Wild Shape feature to take on a starry form rather than transforming into a beast.\n\nWhile in your starry form, you retain your game statistics, but your body takes on a luminous, starlike quality; your joints glimmer like stars, and glowing lines connect them as on a star chart. This form sheds bright light in a 10 foot radius and dim light for an additional 10 feet. The form lasts for 10 minutes or until you're incapacitated.\n\nWhenever you assume your starry form, choose which of the following constellations glimmers on your body; your choice gives you certain benefits while in the form:\n\n- Chalice: A constellation of a life-giving goblet appears on you. Whenever you cast a spell using a spell slot that restores hit points to a creature, you or another creature within 30 feet of you can regain hit points equal to 1d8 + half your level in this class.\n\n- Archer: A constellation of an archer appears on you. You gain a bonus action that you can use to make a ranged spell attack, hurling a luminous arrow that targets a creature you can see within 60 feet of you. On a hit, the attack deals radiant damage equal to 1d8 + your Wisdom modifier.\n\n- Dragon: A constellation of a wise, ancient dragon appears on you. When you make an Intelligence or a Wisdom check or a Constitution saving throw to maintain concentration on a spell, you can treat a roll of 9 or lower on the d20 as a 10.",
            "level": 2
          }
        ],
        "id": "Custombbb5f120-24d0-48ee-b1d3-a2f431a0354a",
        "isFeature": true,
        "jsonType": "feat",
        "level": 1,
        "name": "Starry Form",
        "notes": "",
        "type": "Feat"
      },
      "level": 2
    },
    {
      "feat": {
        "descriptionModels": [
          {
            "description": "You learn to use your star map to divine the will of the cosmos. Whenever you finish a long rest, you can consult your star map for omens. When you do so, roll a d6. You gain one of the following possible omens based on whether you rolled an even number or an odd number on the d6:\n\n- Weal (even): Whenever a creature you can see within 30 feet of you makes an attack roll, a saving throw, or an ability check, you can use your reaction to roll a d6 and add the number rolled to the total.\n\n- Woe (odd): Whenever a creature you can see within 30 feet of you makes an attack roll, a saving throw, or an ability check, you can use your reaction to roll a d6 and subtract the number rolled from the total.\n\nYou can use this reaction a number of times equal to your Wisdom modifier, and you regain all expended uses when you finish a long rest.",
            "level": 6
          }
        ],
        "id": "Custom6436496e-6119-4e6e-9b52-dcda58368be4",
        "isFeature": true,
        "jsonType": "feat",
        "level": 1,
        "name": "Cosmic Omen",
        "notes": "",
        "type": "Feat"
      },
      "level": 6
    },
    {
      "feat": {
        "descriptionModels": [
          {
            "description": "While your Starry Form feature is active, you become partially incorporeal, giving you resistance to bludgeoning, piercing, and slashing damage.",
            "level": 10
          }
        ],
        "id": "Custom98fca60d-eade-4925-a480-140557ca5467",
        "isFeature": true,
        "jsonType": "feat",
        "level": 1,
        "name": "Full of Stars",
        "notes": "",
        "type": "Feat"
      },
      "level": 10
    },
    {
      "feat": {
        "descriptionModels": [
          {
            "description": "Your connection to the cosmos allows you to conjure brilliant starlight. As an action, you conjure a burst of light in a 30-foot-radius sphere centered on a point you can see within 120 feet of you. You can immediately teleport each willing creature in the sphere to an unoccupied space within 30 feet of it. Each creature remaining in the sphere must succeed on a Constitution saving throw against your spell save DC or take 4d10 radiant damage and be blinded until the end of your next turn.\n\nOnce you have used this action, you can't use it again until you finish a long rest or until you expend a spell slot of 5th level or higher to use it again.",
            "level": 14
          }
        ],
        "id": "Custom6a79af7a-c896-4221-a2a7-b8c4038742f2",
        "isFeature": true,
        "jsonType": "feat",
        "level": 1,
        "name": "Star Flare",
        "notes": "",
        "type": "Feat"
      },
      "level": 14
    }
  ],
  "hpModifier": "Constitution",
  "id": "druid_circle_of_the_stars_[ua]",
  "jsonType": "class",
  "languages": [],
  "modelType": "Archetype",
  "multiclassArmor": true,
  "multiclassSkills": true,
  "multiclassTools": true,
  "multiclassWeapons": true,
  "name": "Circle of the Stars [UA]",
  "selectableFeatures": [],
  "shouldShowCompanion": false,
  "skillProficiencies": [],
  "specialAbilities": [],
  "spellSlots": [],
  "spellcastingAbility": "Wisdom",
  "spells": [],
  "subtypes": [],
  "toolProficiencies": [],
  "weaponProficiencies": []
}