{
  "descriptionModels": [
    {
      "description": "Blood Curse of Binding:\nAs a bonus action, you can attempt to bind an enemy no more than one size larger than you within 30 feet. The target must succeed on a Strength saving throw (DC equal to 8 + your proficiency bonus + your Wisdom modifier) or have their speed be reduced to 0 until the end of your next turn.\n\nAmplify: This curse becomes ongoing, and can affect a creature regardless of their size category. At the end of each of its turns, the cursed can make another Strength saving throw. On a success, this curse ends. You can end the curse whenever you like (no action required).\n\nBlood Curse of Mutual Suffering:\nAs a bonus action, you can link to a creature within 30 feet for up to a minute, forcing them to share in the pain they inflict upon you. The next time the cursed creature damages you with a weapon attack, this curse deals necrotic damage to the cursed creature equal to half of the damage you suffered. This curse then ends.\n\nAmplify: This curse instead deals damage equal to the damage you suffered, and it ignores necrotic resistance.\n\nBlood Curse of Purgation:\nAs a bonus action, you can manipulate the vitality of a creature within 60 feet to expunge a corruption in their blood. The target creature can immediately make a saving throw against a poisoned condition afflicting it.\n\nAmplify: Your target can instead immediately make a saving throw against one other condition afflicting it. This condition can be blinded, deafened, or paralyzed.\n\nBlood Curse of Spell Sunder:\nWhen an enemy casts a spell within 60 feet that requires a spell attack roll and targets you, you can use your reaction to rend the spell from the air, imposing disadvantage on the spell attack roll.\n\nAmplify: You make a Wisdom ability check. The DC equals 10 + the spell’s level. On a success, the creature’s spell misses you automatically.\n\nBlood Curse of the Eyeless:\nWhen an enemy who is not immune to blindness within 60 feet makes a weapon attack, you can use your reaction to impose disadvantage on the attack roll.\n\nAmplify: Following the triggering attack, the affected enemy has disadvantage on the next attack roll they make.\n\nBlood Curse of the Fallen Puppet:\nThe moment a creature falls unconscious or dies within 30 feet of you, you can use your reaction to give that creature a final act of aggression. That creature immediately makes a single weapon attack against a target of your choice within its attack range. After the attack, the creature returns to being unconscious or dead.\n\nAmplify: You grant a bonus to the attack roll and damage roll of the cursed creature’s attack equal to your Wisdom modifier (minimum of 1).\n\nBlood Curse of the Fending Rite:\nWhen an enemy casts a spell that requires a Dexterity saving throw, you can use your reaction to deflect the spell with your crimson rite. You gain a bonus to the initial saving throw against that spell equal to your Wisdom modifier (minimum of 1). This curse is invoked before the saving throw is rolled.\n\nAmplify: You grant all allies within 5 feet of you this bonus to their saving throw against the triggering spell as well.\n\nBlood Curse of the Marked:\nAs a bonus action, you can mark an enemy within 60 feet. Until the end of your turn, all crimson rite damage you deal to the target is doubled.\n\nAmplify: You cause the marked target to also lose resistance to your rite damage type until the beginning of your next turn",
      "level": 1
    }
  ],
  "id": "Customb31ade9d-af56-46de-b341-b01c6cebd778",
  "isFeature": true,
  "jsonType": "feat",
  "level": 1,
  "name": "Blood Curses List",
  "notes": "",
  "type": "Feat"
}