{
    "descriptionModels": [
        {
            "description": "You gain the ability to imbue mundane items with certain magical infusions. The magic items you create with this feature are effectively prototypes of permanent items.\n\nINFUSIONS KNOWN\nYou know four artificer infusions. Whenever you gain a level in this class, you can replace one of the artificer infusions you learned with a new one.\n\nINFUSING AN ITEM\nWhenever you finish a long rest, you can touch a nonmagical object and imbue it with one of your artificer infusions, turning it into a magic item. An infusion works on only certain kinds of objects, as specified in the infusion's description. If the item requires attunement, you can attune yourself to it the instant you infuse the item. If you decide to attune to the item later, you must do so using the normal process for attunement. Your infusion remains in an item indefinitely, but when you die, the infusion vanishes after a number of days have passed equal to your Intelligence modifier (minimum of 1 day). The infusion also vanishes if you give up your knowledge of the infusion for another one. You can infuse 2 nonmagical objects at the end of a long rest. You must touch each of the objects, and each of your infusions can be in only one object at a time. Moreover, no object can bear more than one of your infusions at a time. If you try to exceed your maximum number of in fusions, the oldest infusion immediately ends, and then the new infusion applies.",
            "level": 2
        },
        {
            "description": "You gain the ability to imbue mundane items with certain magical infusions. The magic items you create with this feature are effectively prototypes of permanent items.\n\nINFUSIONS KNOWN\nYou know six artificer infusions. Whenever you gain a level in this class, you can replace one of the artificer infusions you learned with a new one.\n\nINFUSING AN ITEM\nWhenever you finish a long rest, you can touch a nonmagical object and imbue it with one of your artificer infusions, turning it into a magic item. An infusion works on only certain kinds of objects, as specified in the infusion's description. If the item requires attunement, you can attune yourself to it the instant you infuse the item. If you decide to attune to the item later, you must do so using the normal process for attunement. Your infusion remains in an item indefinitely, but when you die, the infusion vanishes after a number of days have passed equal to your Intelligence modifier (minimum of 1 day). The infusion also vanishes if you give up your knowledge of the infusion for another one. You can infuse 3 nonmagical objects at the end of a long rest. You must touch each of the objects, and each of your infusions can be in only one object at a time. Moreover, no object can bear more than one of your infusions at a time. If you try to exceed your maximum number of in fusions, the oldest infusion immediately ends, and then the new infusion applies.",
            "level": 6
        },
        {
            "description": "You gain the ability to imbue mundane items with certain magical infusions. The magic items you create with this feature are effectively prototypes of permanent items.\n\nINFUSIONS KNOWN\nYou know eight artificer infusions. Whenever you gain a level in this class, you can replace one of the artificer infusions you learned with a new one.\n\nINFUSING AN ITEM\nWhenever you finish a long rest, you can touch a nonmagical object and imbue it with one of your artificer infusions, turning it into a magic item. An infusion works on only certain kinds of objects, as specified in the infusion's description. If the item requires attunement, you can attune yourself to it the instant you infuse the item. If you decide to attune to the item later, you must do so using the normal process for attunement. Your infusion remains in an item indefinitely, but when you die, the infusion vanishes after a number of days have passed equal to your Intelligence modifier (minimum of 1 day). The infusion also vanishes if you give up your knowledge of the infusion for another one. You can infuse 4 nonmagical objects at the end of a long rest. You must touch each of the objects, and each of your infusions can be in only one object at a time. Moreover, no object can bear more than one of your infusions at a time. If you try to exceed your maximum number of in fusions, the oldest infusion immediately ends, and then the new infusion applies.",
            "level": 10
        },
        {
            "description": "You gain the ability to imbue mundane items with certain magical infusions. The magic items you create with this feature are effectively prototypes of permanent items.\n\nINFUSIONS KNOWN\nYou know ten artificer infusions. Whenever you gain a level in this class, you can replace one of the artificer infusions you learned with a new one.\n\nINFUSING AN ITEM\nWhenever you finish a long rest, you can touch a nonmagical object and imbue it with one of your artificer infusions, turning it into a magic item. An infusion works on only certain kinds of objects, as specified in the infusion's description. If the item requires attunement, you can attune yourself to it the instant you infuse the item. If you decide to attune to the item later, you must do so using the normal process for attunement. Your infusion remains in an item indefinitely, but when you die, the infusion vanishes after a number of days have passed equal to your Intelligence modifier (minimum of 1 day). The infusion also vanishes if you give up your knowledge of the infusion for another one. You can infuse 5 nonmagical objects at the end of a long rest. You must touch each of the objects, and each of your infusions can be in only one object at a time. Moreover, no object can bear more than one of your infusions at a time. If you try to exceed your maximum number of in fusions, the oldest infusion immediately ends, and then the new infusion applies.",
            "level": 14
        },
        {
            "description": "You gain the ability to imbue mundane items with certain magical infusions. The magic items you create with this feature are effectively prototypes of permanent items.\n\nINFUSIONS KNOWN\nYou know twelve artificer infusions. Whenever you gain a level in this class, you can replace one of the artificer infusions you learned with a new one.\n\nINFUSING AN ITEM\nWhenever you finish a long rest, you can touch a nonmagical object and imbue it with one of your artificer infusions, turning it into a magic item. An infusion works on only certain kinds of objects, as specified in the infusion's description. If the item requires attunement, you can attune yourself to it the instant you infuse the item. If you decide to attune to the item later, you must do so using the normal process for attunement. Your infusion remains in an item indefinitely, but when you die, the infusion vanishes after a number of days have passed equal to your Intelligence modifier (minimum of 1 day). The infusion also vanishes if you give up your knowledge of the infusion for another one. You can infuse 6 nonmagical objects at the end of a long rest. You must touch each of the objects, and each of your infusions can be in only one object at a time. Moreover, no object can bear more than one of your infusions at a time. If you try to exceed your maximum number of in fusions, the oldest infusion immediately ends, and then the new infusion applies.",
            "level": 18
        }
    ],
    "id": "Custom0af83c20-5a82-4cd5-a885-c7946aeda4b6",
    "isFeature": true,
    "jsonType": "feat",
    "level": 1,
    "name": "Infuse Item",
    "notes": "",
    "type": "Feat"
}