{
    "descriptionModels": [
        {
            "description": "As an action, you gain 9 special psi points that you can spend only on disciplines that require an action or a bonus action to use. You can use all 9 points on one discipline, or you can spread them across multiple disciplines. You can't also use normal psi points at the same time you use your special psi points. When you finish a long rest, you lose any of these special points that you haven't spent. If more than one of the disciplines you activate with these points require concentration, you can concentrate on all of them. Activating one of them ends any effect you were already concentrating on, and if you begin concentrating on an effect that doesn't use these special points, the disciplines end that you're concentrating on\n\nYou have one use of this feature, and you regain any expended use of it with a long rest",
            "level": 11
        },
        {
            "description": "As an action, you gain 9 special psi points that you can spend only on disciplines that require an action or a bonus action to use. You can use all 9 points on one discipline, or you can spread them across multiple disciplines. You can't also use normal psi points at the same time you use your special psi points. When you finish a long rest, you lose any of these special points that you haven't spent. If more than one of the disciplines you activate with these points require concentration, you can concentrate on all of them. Activating one of them ends any effect you were already concentrating on, and if you begin concentrating on an effect that doesn't use these special points, the disciplines end that you're concentrating on\n\nYou have two uses of this feature, and you regain any expended use of it with a long rest",
            "level": 13
        },
        {
            "description": "As an action, you gain 11 special psi points that you can spend only on disciplines that require an action or a bonus action to use. You can use all 9 points on one discipline, or you can spread them across multiple disciplines. You can't also use normal psi points at the same time you use your special psi points. When you finish a long rest, you lose any of these special points that you haven't spent. If more than one of the disciplines you activate with these points require concentration, you can concentrate on all of them. Activating one of them ends any effect you were already concentrating on, and if you begin concentrating on an effect that doesn't use these special points, the disciplines end that you're concentrating on\n\nYou have three uses of this feature, and you regain any expended use of it with a long rest",
            "level": 15
        },
        {
            "description": "As an action, you gain 11 special psi points that you can spend only on disciplines that require an action or a bonus action to use. You can use all 9 points on one discipline, or you can spread them across multiple disciplines. You can't also use normal psi points at the same time you use your special psi points. When you finish a long rest, you lose any of these special points that you haven't spent. If more than one of the disciplines you activate with these points require concentration, you can concentrate on all of them. Activating one of them ends any effect you were already concentrating on, and if you begin concentrating on an effect that doesn't use these special points, the disciplines end that you're concentrating on\n\nYou have four uses of this feature, and you regain any expended use of it with a long rest",
            "level": 17
        }
    ],
    "id": "Custom9ec038ea-b6fe-465b-a83e-0ab8f671c873",
    "isFeature": true,
    "jsonType": "feat",
    "level": 1,
    "name": "Psionic Mastery",
    "notes": "",
    "type": "Feat"
}