{
    "acModifier": "Dexterity",
    "armorProficiencies": [],
    "attacksByLevel": [],
    "baseAc": 10,
    "classWeapon": {
        "abilityName": "Strength",
        "damageType": "Bludgeoning",
        "diceAmount": 1,
        "diceTypeName": "D4",
        "name": ""
    },
    "effectiveCasterLevel": "PARENT",
    "features": [
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "You have darkvision with a range of 120 feet.",
                        "level": 1
                    },
                    {
                        "description": "You have darkvision with a range of 120 feet. You also learn the Darkness spell which doesn't count against your number of sorcerer spells known. In addition, you can cast it by spending 2 Sorcery Points or by expending a spell slot. If you cast it with sorcery points, you can see through the darkness created by the spell",
                        "level": 3
                    }
                ],
                "id": "Customb1f4cc2a-b47e-43ab-b814-3e12ffd90279",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Eyes of the Dark",
                "notes": "",
                "type": "Feat"
            },
            "level": 1
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "When damage reduces you to 0 hit points, you can make a Charisma saving throw (DC 5 + damage taken). On a success you instead drop to 1 hit point. You can't use this feature if you are reduced to 0 Hit Points by radiant damage or by a critical hit.\n\nAfter the saving throw succeeds you can't use this feature again until you finish a long rest",
                        "level": 1
                    }
                ],
                "id": "Custom68391108-fc83-4c8c-9658-0bdb6eafba27",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Strength of the Grave",
                "notes": "",
                "type": "Feat"
            },
            "level": 1
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "As a bonus action you can spend 3 Sorcery Points to magically summon a hound of ill omen to target one creature you can see within 120 feet of you. The hound uses the Dire Wolf's statistics, with the following changes:\n\n- The hound is size Medium, not Large, and it counts as a Monstrosity, not a Beast.\n\n- It appears with a number of temporary Hit Points equal to half your Sorcerer Level.\n\n- It can move through other creatures and objects as if they were difficult terrain. The hound takes 5 force damage if it ends its turn inside an object.\n\n- At the start of its turn the hound automatically knows its target's location. If the target was hidden it is no longer hidden from the hound.\n\nThe hound appears in an unoccupied space of your choice within 30 feet of the target. Roll Initiative for the hound. On its turn it can only move toward its target by the most direct route and it can use its action only to attack its target. The hound can make opportunity attacks but only against its target. Additionally, while the hound is within 5 feet of its target the target has disadvantage on saving throws against any spell you cast. The hound disappears if it is reduced to 0 Hit Points, if its target is reduced to 0 Hit Points, or after 5 minutes",
                        "level": 6
                    }
                ],
                "id": "Customc49e969c-661c-4610-889d-6e9b5e58686a",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Hound of Ill Omen",
                "notes": "",
                "type": "Feat"
            },
            "level": 6
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "When you are in dim light or darkness, as a bonus action, you can magically teleport up to 120 feet to an unoccupied space you can see that is also in dim light or darkness",
                        "level": 14
                    }
                ],
                "id": "Custom045f1bc4-2199-46bf-97cb-931337d62c5a",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Shadow Walk",
                "notes": "",
                "type": "Feat"
            },
            "level": 14
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "You can spend 6 Sorcery Points as a bonus action to magically transform yourself into a shadowy form. In this form, you have resistance to all damage except force and radiant damage, and you can move through other creatures and objects as if they were difficult terrain. You take 5 force damage if you end your turn inside an object.\n\nYou remain in this form for 1 minute. It ends early if you are incapacitated, if you die, or if you dismiss it as a bonus action",
                        "level": 18
                    }
                ],
                "id": "Custom5dd845a2-8c07-4110-9e5b-69a9ca599c99",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Umbral Form",
                "notes": "",
                "type": "Feat"
            },
            "level": 18
        }
    ],
    "hpModifier": "Constitution",
    "id": "sorcerer_shadow_magic",
    "jsonType": "class",
    "languages": [],
    "modelType": "Archetype",
    "multiclassArmor": true,
    "multiclassSkills": true,
    "multiclassTools": true,
    "multiclassWeapons": true,
    "name": "Shadow Magic",
    "selectableFeatures": [],
    "shouldShowCompanion": false,
    "skillProficiencies": [],
    "specialAbilities": [],
    "spellSlots": [],
    "spellcastingAbility": "Charisma",
    "spells": [
        {
            "level": 3,
            "spellModel": {
                "castingTime": "1 action",
                "classes": "sorcerer, warlock, blood_hunter, fighter, rogue, wizard",
                "components": "V, M (bat fur and a drop of pitch or piece of coal)",
                "description": "Magical darkness spreads from a point you choose within range to fill a 15-foot-radius sphere for the duration. The darkness spreads around corners. A creature with darkvision can’t see through this darkness, and nonmagical light can’t illuminate it. If the point you choose is on an object you are holding or one that isn’t being worn or carried, the darkness emanates from the object and moves with it. Completely covering the source of the darkness with an opaque object, such as a bowl or a helm, blocks the darkness. If any of this spell’s area overlaps with an area of light created by a spell of 2nd level or lower, the spell that created the light is dispelled.",
                "duration": "Concentration, up to 10 minutes",
                "higherLevels": "",
                "isCustom": false,
                "isRitual": false,
                "jsonType": "spell",
                "level": 2,
                "name": "Darkness",
                "notes": "",
                "pinned": false,
                "prepared": false,
                "range": "60 feet",
                "school": "evocation",
                "type": "2nd-Level evocation"
            }
        }
    ],
    "subtypes": [],
    "toolProficiencies": [],
    "weaponProficiencies": []
}