{
    "abilityScores": {
        "cha": 2,
        "con": 0,
        "dex": 0,
        "intelligence": 0,
        "str": 0,
        "wis": 1
    },
    "ac": 10,
    "armorProficiencies": [],
    "id": "Customd38fb759-3f72-497b-a3c1-1e60540cd172",
    "jsonType": "race",
    "languages": [
        {
            "hint": "",
            "level": 1,
            "proficiency": "Infernal"
        }
    ],
    "name": "Fierna",
    "racialWeapon": {
        "abilityName": "Strength",
        "damageType": "Bludgeoning",
        "diceAmount": 1,
        "diceTypeName": "D4",
        "name": ""
    },
    "skillProficiencies": [],
    "speed": {
        "burrow": 0,
        "climb": 0,
        "fly": 0,
        "normal": 30,
        "swim": 0
    },
    "spellcastingAbility": "CHA",
    "spells": [
        {
            "level": 1,
            "spellModel": {
                "castingTime": "1 action",
                "classes": "Bard, Sorcerer, Warlock, Wizard",
                "components": "S, M (a small amount of makeup applied to the face as this spell is cast)",
                "description": "For the duration, you have advantage on all Charisma checks directed at one creature of your choice that isn't hostile toward you. When the spell ends, the creature realizes that you have used magic to influence its mood and becomes hostile toward you. A creature prone to violence might attack you. Another creature might seek retribution in other ways (at the DM's discretion), depending on the nature of your interaction with it.",
                "duration": "Concentration, up to 1 minute",
                "higherLevels": "",
                "isCustom": false,
                "isRitual": false,
                "level": 0,
                "name": "Friends",
                "range": "Self",
                "school": "Enchantment",
                "type": "Enchantment cantrip"
            }
        },
        {
            "level": 3,
            "spellModel": {
                "castingTime": "1 action",
                "classes": "Bard, Cleric, Druid, Sorcerer, Warlock, Wizard",
                "components": "V, S",
                "description": "You attempt to charm a humanoid you can see within range. It must make a Wisdom saving throw, and does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is charmed by you until the spell ends or until you or your companions do anything harmful to it. The charmed creature regards you as a friendly acquaintance. When the spell ends, the creature knows it was charmed by you.",
                "duration": "1 hour",
                "higherLevels": "When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st. The creatures must be within 30 feet of each other when you target them.",
                "isCustom": false,
                "isRitual": false,
                "level": 1,
                "name": "Charm Person",
                "range": "30 feet",
                "school": "enchantment",
                "type": "1st-level enchantment"
            }
        },
        {
            "level": 5,
            "spellModel": {
                "castingTime": "1 action",
                "classes": "Bard, Sorcerer, Warlock, Wizard",
                "components": "V, M (a snake's tongue and either a bit of honeycomb or a drop of sweet oil)",
                "description": "You suggest a course of activity (limited to a sentence or two) and magically influence a creature you can see within range that can hear and understand you. Creatures that can't be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act ends the spell.\n\nThe target must make a Wisdom saving throw. On a failed save, it pursues the course of action you described to the best of its ability. The suggested course of action can continue for the entire duration. If the suggested activity can be completed in a shorter time, the spell ends when the subject finishes what it was asked to do.\n\nYou can also specify conditions that will trigger a special activity during the duration. For example, you might suggest that a knight give her warhorse to the first beggar she meets. If the condition isn't met before the spell expires, the activity isn't performed.\n\nIf you or any of your companions damage the target, the spell ends.",
                "duration": "Concentration, up to 8 hours",
                "higherLevels": "",
                "isCustom": false,
                "isRitual": false,
                "level": 2,
                "name": "Suggestion",
                "range": "30 feet",
                "school": "enchantment",
                "type": "2nd-level enchantment"
            }
        }
    ],
    "toolProficiencies": [],
    "traits": [
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "You have resistance to fire damage",
                        "level": 1
                    }
                ],
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Hellish Resistance",
                "notes": "",
                "type": "Feat"
            },
            "level": 1
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "You know the Friends cantrip. Charisma is your spellcasting ability for this spell",
                        "level": 1
                    },
                    {
                        "description": "You know the Friends cantrip. When you reach 3rd level, you can cast the Charm Person spell as a 2nd-level spell once with this trait and regain the ability to do so when you finish a long rest. Charisma is your spellcasting ability for these spells",
                        "level": 3
                    },
                    {
                        "description": "You know the Friends cantrip. When you reach 3rd level, you can cast the Charm Person spell as a 2nd-level spell once with this trait and regain the ability to do so when you finish a long rest. When you reach 5th level, you can cast the Suggestion spell once with this trait and regain the ability to do so when you finish a long rest. Charisma is your spellcasting ability for these spells",
                        "level": 5
                    }
                ],
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Legacy of Phlegethos",
                "notes": "",
                "type": "Feat"
            },
            "level": 1
        }
    ],
    "weaponProficiencies": []
}