{
  "acModifier": "Dexterity",
  "armorProficiencies": [],
  "attacksByLevel": [],
  "baseAc": 10,
  "classWeapon": {
    "abilityName": "Strength",
    "damageType": "Bludgeoning",
    "diceAmount": 1,
    "diceTypeName": "D4",
    "name": ""
  },
  "effectiveCasterLevel": "PARENT",
  "features": [
    {
      "feat": {
        "descriptionModels": [
          {
            "description": "You gain the following benefits:\n\n- Kensei Weapons: Choose two types of weapons to be your kensei weapons: one melee weapon and one ranged weapon. Each of these weapons can be any simple or martial weapon that lacks the heavy and special properties. The longbow is also a valid choice. You gain proficiency with these weapons if you don't already have it. Weapons of the chosen types are monk weapons for you. When you reach 6th, 11th, and 17th level in this class, you can choose another type of weapon— either melee or ranged —to be a kensei weapon for you, following the criteria above.\n\n- Agile Parry: If you make an unarmed strike as part of the Attack action on your turn and are holding a kensei weapon, you can use it to defend yourself if it is a melee weapon. You gain a +2 bonus to AC until the start of your next turn, while the weapon is in your hand and you aren't incapacitated.\n\n- Kensei's Shot: You can use a bonus action on your turn to make any target you hit with a ranged attack using a kensei weapon take an extra 1d4 damage of the weapon's type. You retain this benefit until the end of the current turn.\n\n- Way of the Brush: You gain proficiency with your choice of calligrapher's supplies or painter's supplies",
            "level": 3
          }
        ],
        "id": "Customc475b98f-19b3-44f7-a7d5-a6ca74bdd0d4",
        "isFeature": true,
        "jsonType": "feat",
        "level": 1,
        "name": "Path of the Kensei",
        "notes": "",
        "type": "Feat"
      },
      "level": 3
    },
    {
      "feat": {
        "descriptionModels": [
          {
            "description": "You gain the following benefits.\n\n- Magic Kensei Weapons: Your attacks with your kensei weapons count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.\n\n- Deft Strike: When you hit a target with a kensei weapon, you can spend 1 ki point to cause the weapon to deal extra damage to the target equal to your Martial Arts die. You can use this feature only once on each of your turns",
            "level": 6
          }
        ],
        "id": "Custom8f25acea-eae5-466b-aa06-3f213b7cae55",
        "isFeature": true,
        "jsonType": "feat",
        "level": 1,
        "name": "One with the Blade",
        "notes": "",
        "type": "Feat"
      },
      "level": 6
    },
    {
      "feat": {
        "descriptionModels": [
          {
            "description": "As a bonus action, you can expend up to 3 ki points to grant one kensei weapon you touch a bonus to attack and damage rolls when you attack with it. The bonus equals the number of ki points you spent. This bonus lasts for 1 minute or until you use this feature again. This feature has no effect on a magic weapon that already has a bonus to attack and damage rolls",
            "level": 11
          }
        ],
        "id": "Custom336bd33c-4b15-4565-977e-3c421a67fd8f",
        "isFeature": true,
        "jsonType": "feat",
        "level": 1,
        "name": "Sharpen the Blade",
        "notes": "",
        "type": "Feat"
      },
      "level": 11
    },
    {
      "feat": {
        "descriptionModels": [
          {
            "description": "If you miss with an attack roll using a monk weapon on your turn, you can reroll it. You can use this feature only once on each of your turns",
            "level": 17
          }
        ],
        "id": "Customebb18aa8-be3c-4fa2-ac32-fa18d39370cf",
        "isFeature": true,
        "jsonType": "feat",
        "level": 1,
        "name": "Unerring Accuracy",
        "notes": "",
        "type": "Feat"
      },
      "level": 17
    }
  ],
  "hpModifier": "Constitution",
  "id": "monk_way_of_the_kensei",
  "jsonType": "class",
  "languages": [],
  "modelType": "Archetype",
  "multiclassArmor": true,
  "multiclassSkills": true,
  "multiclassTools": true,
  "multiclassWeapons": true,
  "name": "Way of the Kensei",
  "selectableFeatures": [],
  "shouldShowCompanion": false,
  "skillProficiencies": [],
  "specialAbilities": [],
  "spellSlots": [],
  "spellcastingAbility": "Wisdom",
  "spells": [],
  "subtypes": [],
  "toolProficiencies": [],
  "unarmoredDefense": "Wisdom",
  "weaponProficiencies": []
}