{
    "acModifier": "Dexterity",
    "armorProficiencies": [],
    "attacksByLevel": [],
    "baseAc": 10,
    "classWeapon": {
        "abilityName": "Strength",
        "damageType": "Bludgeoning",
        "diceAmount": 1,
        "diceTypeName": "D4",
        "name": ""
    },
    "effectiveCasterLevel": "PARENT",
    "features": [
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "Your mastery of your ki allows you to summon a portion of your astral self. As a bonus action, you can spend 1 ki point to summon the arms of your astral self. When you do so, each creature of your choice that you can see within 10 feet of you must succeed on a Dexterity saving throw or take force damage equal to two rolls of your Martial Arts die.\n\nFor 10 minutes, these spectral arms hover near your shoulders or surround your arms (your choice). You determine the arms' appearance, and they vanish early if you are incapacitated or die.\n\nWhile the spectral arms are present, you gain the following benefits:\n\n- You can use your Wisdom modifier in place of your Strength modifier when making Strength checks and Strength saving throws.\n\n- You can use the spectral arms to make unarmed strikes.\n\n- When you make an unarmed strike with the arms on your turn, your reach for it is 5 feet greater than normal.\n\n- The unarmed strikes you make with the arms can use your Wisdom modifier in place of your Strength or Dexterity modifier for the attack and damage rolls, and their damage type is force",
                        "level": 3
                    }
                ],
                "id": "Custom15beb610-85f1-46d4-b085-15ec7d9dcd55",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Arms of the Astral Self",
                "notes": "",
                "type": "Feat"
            },
            "level": 3
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "You can summon the visage of your astral self. As a bonus action, or as part of the bonus action you take to activate Arms of the Astral Self, you can spend 1 ki point to summon this visage for 10 minutes. It vanishes early if you are incapacitated or die.\n\nThe spectral visage covers your face like a helmet or mask. You determine its appearance.\n\nWhile the spectral visage is present, you gain the following benefits.\n\n- Astral Sight: You can see normally in darkness, both magical and nonmagical, to a distance of 120 feet.\n\n- Wisdom of the Spirit: You have advantage on Wisdom (Insight) and Charisma (Intimidation) checks.\n\n- Word of the Spirit: When you speak, you can direct your words to a creature of your choice that you can see within 60 feet of you, making it so only that creature can hear you. Alternatively, you can amplify your voice so that all creatures within 600 feet can hear you",
                        "level": 6
                    }
                ],
                "id": "Custom3ef67ea7-5fec-4837-ab4b-2afe6be2d3a8",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Visage of the Astral Self",
                "notes": "",
                "type": "Feat"
            },
            "level": 6
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "When you have both your astral arms and visage summoned, you can cause the body of your astral self to appear (no action required). This spectral body covers your physical form like a suit of armor, connecting with the arms and visage. You determine its appearance.\n\nWhile the spectral body is present, you gain the following benefits.\n\n- Deflect Energy: When you take acid, cold, fire, force, lightning, or thunder damage, you can use your reaction to deflect it. When you do so, the damage you take is reduced by 1d10 + your Wisdom modifier (minimum reduction of 1).\n\n- Empowered Arms: Once on each of your turns when you hit a target with the Arms of the Astral Self, you can deal extra damage to the target equal to your Martial Arts die",
                        "level": 11
                    }
                ],
                "id": "Custom7a0f1fe7-445b-445a-bd36-d1dff548fa27",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Body of the Astral Self",
                "notes": "",
                "type": "Feat"
            },
            "level": 11
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "Your connection to your astral self is complete, allowing you to unleash its full potential. As a bonus action, you can spend 5 ki points to summon the arms, visage, and body of your astral self and awaken it for 10 minutes. This awakening ends early if you are incapacitated or die.\n\nWhile your astral self is awakened, you gain the following benefits.\n\n- Armor of the Spirit: You gain a +2 bonus to Armor Class.\n\n- Astral Barrage: Whenever you use the Extra Attack feature to attack twice, you can instead attack three times if all the attacks are made with your astral arms",
                        "level": 17
                    }
                ],
                "id": "Customb03e4c4e-05c9-42c9-98d7-df9ff883a18b",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Awakened Astral Self",
                "notes": "",
                "type": "Feat"
            },
            "level": 17
        }
    ],
    "hpModifier": "Constitution",
    "id": "monk_way_of_the_astral_self_[tce]",
    "jsonType": "class",
    "languages": [],
    "modelType": "Archetype",
    "multiclassArmor": true,
    "multiclassSkills": true,
    "multiclassTools": true,
    "multiclassWeapons": true,
    "name": "Way of the Astral Self [TCE]",
    "selectableFeatures": [],
    "shouldShowCompanion": false,
    "skillProficiencies": [],
    "specialAbilities": [],
    "spellSlots": [],
    "spellcastingAbility": "Wisdom",
    "spells": [],
    "subtypes": [],
    "toolProficiencies": [],
    "unarmoredDefense": "Wisdom",
    "weaponProficiencies": []
}