{
  "acModifier": "Dexterity",
  "armorProficiencies": [],
  "attacksByLevel": [],
  "baseAc": 10,
  "classWeapon": {
    "abilityName": "Strength",
    "damageType": "Bludgeoning",
    "diceAmount": 1,
    "diceTypeName": "D4",
    "name": ""
  },
  "effectiveCasterLevel": "PARENT",
  "features": [
    {
      "feat": {
        "descriptionModels": [
          {
            "description": "You learn additional spells when you reach certain levels in this class, as shown on the Clockwork Spells table. Each spell counts as a sorcerer spell for you, but it doesn't count against the number of sorcerer spells you know.\n\nThese spells can't be replaced when you gain a level in this class.\n\nSorcerer Level --> spells\n\n1st --> alarm, protection from evil and good ",
            "level": 1
          },
          {
            "description": "You learn additional spells when you reach certain levels in this class, as shown on the Clockwork Spells table. Each spell counts as a sorcerer spell for you, but it doesn't count against the number of sorcerer spells you know.\n\nThese spells can't be replaced when you gain a level in this class.\n\nSorcerer Level --> spells\n\n1st --> alarm, protection from evil and good \n3rd --> find traps, heat metal",
            "level": 3
          },
          {
            "description": "You learn additional spells when you reach certain levels in this class, as shown on the Clockwork Spells table. Each spell counts as a sorcerer spell for you, but it doesn't count against the number of sorcerer spells you know.\n\nThese spells can't be replaced when you gain a level in this class.\n\nSorcerer Level --> spells\n\n1st --> alarm, protection from evil and good \n3rd --> find traps, heat metal\n5th --> counterspell, glyph of warding",
            "level": 5
          },
          {
            "description": "You learn additional spells when you reach certain levels in this class, as shown on the Clockwork Spells table. Each spell counts as a sorcerer spell for you, but it doesn't count against the number of sorcerer spells you know.\n\nThese spells can't be replaced when you gain a level in this class.\n\nSorcerer Level --> spells\n\n1st --> alarm, protection from evil and good \n3rd --> find traps, heat metal\n5th --> counterspell, glyph of warding\n7th --> arcane eye, Otiluke's resilient sphere ",
            "level": 7
          },
          {
            "description": "You learn additional spells when you reach certain levels in this class, as shown on the Clockwork Spells table. Each spell counts as a sorcerer spell for you, but it doesn't count against the number of sorcerer spells you know.\n\nThese spells can't be replaced when you gain a level in this class.\n\nSorcerer Level --> spells\n\n1st --> alarm, protection from evil and good \n3rd --> find traps, heat metal\n5th --> counterspell, glyph of warding\n7th --> arcane eye, Otiluke's resilient sphere \n9th --> animate objects, wall of force",
            "level": 9
          }
        ],
        "id": "Customf720c50b-0f4d-4652-8bed-35d2fc7c5afe",
        "isFeature": true,
        "jsonType": "feat",
        "level": 1,
        "name": "Clockwork Magic",
        "notes": "",
        "type": "Feat"
      },
      "level": 1
    },
    {
      "feat": {
        "descriptionModels": [
          {
            "description": "Your connection to the plane of absolute order allows you to equalize chaotic moments. When a creature you can see within 60 feet of you is about to roll a d20 with advantage or disadvantage, you can use your reaction to prevent the roll from being affected by advantage and disadvantage.\n\nYou can use this feature a number of times equal to your Charisma modifier (minimum of once), and you regain all expended uses when you finish a long rest.",
            "level": 1
          }
        ],
        "id": "Custom13fa843b-3955-4b14-99f8-181de098e6dc",
        "isFeature": true,
        "jsonType": "feat",
        "level": 1,
        "name": "Restore Balance",
        "notes": "",
        "type": "Feat"
      },
      "level": 1
    },
    {
      "feat": {
        "descriptionModels": [
          {
            "description": "You can imbue a creature with a shimmering shield of order. As an action, you can expend 1 to 5 sorcery points to create a magical ward around yourself or another creature you can see within 30 feet of you. The ward lasts until you finish a long rest or until you use this feature again.\n\nThe ward is represented by a number of d8s equal to the number of sorcery points spent to create it. When the warded creature takes damage, it can use its reaction to spend a number of those dice, roll them, and reduce the damage taken by the total of the spent dice.",
            "level": 6
          }
        ],
        "id": "Custom756fd7c7-a099-4abd-b705-cf385f87cfcb",
        "isFeature": true,
        "jsonType": "feat",
        "level": 1,
        "name": "Bulwark of Law",
        "notes": "",
        "type": "Feat"
      },
      "level": 6
    },
    {
      "feat": {
        "descriptionModels": [
          {
            "description": "You gain the ability to enter a state of clockwork consciousness as a bonus action. For the next minute, attack rolls against you can't benefit from advantage, and whenever you make an attack roll, an ability check, or a saving throw, you can treat a d20 roll of 9 or lower as a 10.\n\nOnce you use this action, you can't use it again until you finish a long rest or until you expend 5 sorcery points to use it again.",
            "level": 14
          }
        ],
        "id": "Customed73e364-8c1b-4ff3-a30e-616a1f4dc160",
        "isFeature": true,
        "jsonType": "feat",
        "level": 1,
        "name": "Trance of Order",
        "notes": "",
        "type": "Feat"
      },
      "level": 14
    },
    {
      "feat": {
        "descriptionModels": [
          {
            "description": "You summon spirits of order to restore balance around you. As an action, you summon the spirits in a 30-foot cube originating from you.\n\nThe spirits look like modrons or other constructs of your choice. The spirits are intangible and invulnerable, work fast and efficiently, and create the following effects within the cube before vanishing:\n\n- The spirits restore up to 100 hit points, divided as you choose among any number of creatures of your choice in the cube.\n\n- Any damaged objects entirely in the cube are repaired.\n\n- Every spell of 6th level or lower ends on creatures and objects of your choice in the cube.\n\nOnce you use this action, you can't use it again until you finish a long rest or until you expend 7 sorcery points to use it again.",
            "level": 18
          }
        ],
        "id": "Custom3df8eeac-1600-4790-b178-03d207ab0c90",
        "isFeature": true,
        "jsonType": "feat",
        "level": 1,
        "name": "Clockwork Cavalcade",
        "notes": "",
        "type": "Feat"
      },
      "level": 18
    }
  ],
  "hpModifier": "Constitution",
  "id": "sorcerer_clockwork_soul_[ua]",
  "jsonType": "class",
  "languages": [],
  "modelType": "Archetype",
  "multiclassArmor": true,
  "multiclassSkills": true,
  "multiclassTools": true,
  "multiclassWeapons": true,
  "name": "Clockwork Soul [UA]",
  "selectableFeatures": [],
  "shouldShowCompanion": false,
  "skillProficiencies": [],
  "specialAbilities": [],
  "spellSlots": [],
  "spellcastingAbility": "Charisma",
  "spells": [
    {
      "level": 1,
      "spellModel": {
        "castingTime": "1 action",
        "classes": "artificer, artificer__eb_, artificer__revised_, ranger__revised__, revised_ranger, ranger, fighter, rogue, wizard",
        "components": "V, S, M (a tiny bell and a piece of fine silver wire)",
        "description": "You set an alarm against unwanted intrusion. Choose a door, a window, or an area within range that is no larger than a 20-foot cube. Until the spell ends, an alarm alerts you whenever a Tiny or larger creature touches or enters the warded area. When you cast the spell, you can designate creatures that won't set off the alarm. You also choose whether the alarm is mental or audible.\n\nA mental alarm alerts you with a ping in your mind if you are within 1 mile of the warded area. This ping awakens you if you are sleeping.\n\nAn audible alarm produces the sound of a hand bell for 10 seconds within 60 feet.",
        "duration": "8 hours",
        "higherLevels": "",
        "isCustom": false,
        "isRitual": true,
        "jsonType": "spell",
        "level": 1,
        "name": "Alarm",
        "notes": "",
        "pinned": false,
        "prepared": false,
        "range": "30 feet",
        "school": "abjuration",
        "type": "1st-level abjuration (ritual)"
      }
    },
    {
      "level": 1,
      "spellModel": {
        "castingTime": "1 action",
        "classes": "cleric, paladin, warlock, blood_hunter, fighter, rogue, wizard",
        "components": "V, S, M (holy water or powdered silver and iron, which the spell consumes)",
        "description": "Until the spell ends, one willing creature you touch is protected against certain types of creatures: aberrations, celestials, elementals, fey, fiends, and undead.\nThe protection grants several benefits. Creatures of those types have disadvantage on attack rolls against the target. The target also can't be charmed, frightened, or possessed by them. If the target is already charmed, frightened, or possessed by such a creature, the target has advantage on any new saving throw against the relevant effect.",
        "duration": "Concentration, up to 10 minutes",
        "higherLevels": "",
        "isCustom": false,
        "isRitual": false,
        "jsonType": "spell",
        "level": 1,
        "name": "Protection from Evil and Good",
        "notes": "",
        "pinned": false,
        "prepared": false,
        "range": "Touch",
        "school": "abjuration",
        "type": "1st-level abjuration"
      }
    },
    {
      "level": 3,
      "spellModel": {
        "castingTime": "1 action",
        "classes": "cleric, druid, ranger__revised__, revised_ranger, ranger",
        "components": "V, S",
        "description": "You sense the presence of any trap within range that is within Line of Sight. A trap, for the Purpose of this spell, includes anything that would inflict a sudden or unexpected Effect you consider harmful or undesirable, which was specifically intended as such by its creator. Thus, the spell would sense an area affected by the alarm spell, a Glyph of Warding, or a mechanical Pit Trap, but it would not reveal a natural weakness in the floor, an unstable ceiling, or a hidden sinkhole.\n\nThis spell merely reveals that a trap is present. You don't learn the Location of each trap, but you do learn the general Nature of the danger posed by a trap you sense",
        "duration": "Instantaneous",
        "higherLevels": "",
        "isCustom": false,
        "isRitual": false,
        "jsonType": "spell",
        "level": 2,
        "name": "Find Traps",
        "notes": "",
        "pinned": false,
        "prepared": false,
        "range": "120 feet",
        "school": "divination",
        "type": "2nd-level divination"
      }
    },
    {
      "level": 3,
      "spellModel": {
        "castingTime": "1 action",
        "classes": "artificer__eb_, artificer__revised_, druid, bard",
        "components": "V, S, M (a piece of iron and a flame)",
        "description": "Choose a manufactured metal object, such as a metal weapon or a suit of heavy or medium metal armor, that you can see within range. You cause the object to glow red-hot. Any creature in physical contact with the object takes 2d8 fire damage when you cast the spell. Until the spell ends, you can use a bonus action on each of your subsequent turns to cause this damage again.\n\nIf a creature is holding or wearing the object and takes the damage from it, the creature must succeed on a Constitution saving throw or drop the object if it can. If it doesn’t drop the object, it has disadvantage on attack rolls and ability checks until the start of your next turn.",
        "duration": "Concentration, up to 1 minute",
        "higherLevels": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.",
        "isCustom": false,
        "isRitual": false,
        "jsonType": "spell",
        "level": 2,
        "name": "Heat Metal",
        "notes": "",
        "pinned": false,
        "prepared": false,
        "range": "60 feet",
        "school": "transmutation",
        "type": "2nd-level transmutation"
      }
    },
    {
      "level": 5,
      "spellModel": {
        "castingTime": "1 reaction, which you take when you see a creature within 60 feet of you casting a spell.",
        "classes": "sorcerer, warlock, blood_hunter, fighter, rogue, wizard",
        "components": "S",
        "description": "You attempt to interrupt a creature in the process of casting a spell. If the creature is casting a spell of 3rd level or lower, its spell fails and has no effect. If it is casting a spell of 4th level or higher, make an ability check using your spellcasting ability. The DC equals 10 + the spell’s level. On a success, the creature’s spell fails and has no effect.",
        "duration": "Instantaneous",
        "higherLevels": "When you cast this spell using a spell slot of 4th level or higher, the interrupted spell has no effect if its level is less than or equal to the level of the spell slot you used.",
        "isCustom": false,
        "isRitual": false,
        "jsonType": "spell",
        "level": 3,
        "name": "Counterspell",
        "notes": "",
        "pinned": false,
        "prepared": false,
        "range": "60 feet",
        "school": "abjuration",
        "type": "3rd-level abjuration"
      }
    },
    {
      "level": 5,
      "spellModel": {
        "castingTime": "1 hour",
        "classes": "artificer, artificer__eb_, artificer__revised_, cleric, fighter, rogue, wizard, bard",
        "components": "V, S, M, (incense and powdered diamond worth at least 200 gp, which the spell consumes)",
        "description": "When you cast this spell, you inscribe a glyph that harms other creatures, either upon a surface (such as a table or a section of floor or wall) or within an object that can be closed (such as a book, a scroll, or a treasure chest) to conceal the glyph. If you choose a surface, the glyph can cover an area of the surface no larger than 10 feet in diameter. If you choose an object, that object must remain in its place; if the object is moved more than 10 feet from where you cast this spell, the glyph is broken, and the spell ends without being triggered.\n\nThe glyph is nearly invisible and requires a successful Intelligence (Investigation) check against your spell save DC to be found.\n\nYou decide what triggers the glyph when you cast the spell. For glyphs inscribed on a surface, the most typical triggers include touching or standing on the glyph, removing another object covering the glyph, approaching within a certain distance of the glyph, or manipulating the object on which the glyph is inscribed. For glyphs inscribed within an object, the most common triggers include opening that object, approaching within a certain distance of the object, or seeing or reading the glyph. Once a glyph is triggered, this spell ends.\n\nYou can further refine the trigger so the spell activates only under certain circumstances or according to physical characteristics (such as height or weight), creature kind (for example, the ward could be set to affect aberrations or drow), or alignment. You can also set conditions for creatures that don’t trigger the glyph, such as those who say a certain password.\n\nWhen you inscribe the glyph, choose *explosive runes* or a *spell glyph*.\n\n- Explosive Runes: When triggered, the glyph erupts with magical energy in a 20-foot-radius sphere. The sphere spreads around corners. Each creature must make a Dexterity save. A creature takes 5d8 acid, cold, fire, lightning, or thunder damage on a failure (your choice when you create the glyph), or half damage on a success.\n\n- Spell Glyph: You can store a prepared spell of 3rd level or lower by casting it as part of creating the glyph. The spell must target a single creature or an area. The spell being stored has no immediate effect. When the glyph is triggered, the stored spell is cast. If the spell has a target, it targets the triggering creature. If the spell affects an area, the area is centered on that creature. If the spell summons hostile or harmful things, they appear as close as possible to the creature and attack it. If the spell requires concentration, it lasts for the full duration.",
        "duration": "Until dispelled or triggered",
        "higherLevels": "When you cast this spell using a spell slot of 4th level or higher, the damage of an *explosive runes* glyph increases by 1d8 for each slot level above 3rd. If you create a *spell glyph*, you can store any spell of up to the same level as the slot you use for the *glyph of warding*.",
        "isCustom": false,
        "isRitual": false,
        "jsonType": "spell",
        "level": 3,
        "name": "Glyph of Warding",
        "notes": "",
        "pinned": false,
        "prepared": false,
        "range": "Touch",
        "school": "abjuration",
        "type": "3rd-level abjuration"
      }
    },
    {
      "level": 7,
      "spellModel": {
        "castingTime": "1 action",
        "classes": "artificer, artificer__eb_, artificer__revised_, fighter, rogue, wizard",
        "components": "V, S, M (a bit of bat fur)",
        "description": "You create an invisible, magical eye within range that hovers in the for the duration.\n\nYou mentally recieve visual information from the eye, which has normal vision and darkvision out to 30 feet. The eye can look in every direction.\n\nAs an action, you can move the eye up to 30 feet in any direction. There is no limit to how far away from you the eye can move, but it can't enter another plane of existence. A solid barrier blocks the eye's movement, but the eye can pass through an opening as small as 1 inch in diameter.",
        "duration": "Concentration, up to 1 hour",
        "higherLevels": "",
        "isCustom": false,
        "isRitual": false,
        "jsonType": "spell",
        "level": 4,
        "name": "Arcane Eye",
        "notes": "",
        "pinned": false,
        "prepared": false,
        "range": "30 feet",
        "school": "divination",
        "type": "4th-level divination"
      }
    },
    {
      "level": 7,
      "spellModel": {
        "castingTime": "1 action",
        "classes": "artificer, artificer__eb_, artificer__revised_, fighter, rogue, wizard",
        "components": "V S M (Clear crystal hemisphere, gum arabic hemisphere)",
        "description": "A sphere encloses a Large or smaller creature or object. An unwilling creature must make a Dexterity save. On a failure, the creature is enclosed.\nNothing can pass through the barrier, though a creature in the sphere can breathe. The sphere is immune to all damage, and a creature or object inside can't be affected by anything outside the sphere, nor can it affect anything outside in turn.\nThe sphere is weightless and just large enough to contain the creature or object. An enclosed creature can use its action to push against the sphere and roll it at up to half the creature's speed. The globe also can be picked up and moved by other creatures.\nA Disintegrate targeting the globe destroys it without harming anything inside.",
        "duration": "Conc. Up to 1 minute",
        "higherLevels": "",
        "isCustom": false,
        "isRitual": false,
        "jsonType": "spell",
        "level": 4,
        "name": "Otiluke's Resilient Sphere",
        "notes": "",
        "pinned": false,
        "prepared": false,
        "range": "30 feet",
        "school": "Evocation",
        "type": "4th-level evocation"
      }
    },
    {
      "level": 9,
      "spellModel": {
        "castingTime": "1 action",
        "classes": "artificer__eb_, artificer__revised_, bard, sorcerer, fighter, rogue, wizard",
        "components": "V, S",
        "description": "Objects come to life at your command. Choose up to ten nonmagical objects within range that are not being worn or carried. Medium targets count as two objects, Large targets count as four objects, Huge targets count as eight objects. You can't animate any object larger than Huge. Each target animates and becomes a creature under your control until the spell ends or until reduced to 0 hit points.\n\nAs a bonus action, you can mentally command any creature you made with this spell if the creature is within 500 feet of you (if you control multiple creatures, you can command any or all of them at the same time, issuing the same command to each one). You decide what action the creature will take and where it will move during its next turn, or you can issue a general command, such as to guard a particular chamber or corridor. If you issue no commands, the creature only defends itself against hostile creatures. Once given an order, the creature continues to follow it until its task is complete.\n\n| Size   | HP | AC | Attack   | Str | Dex |\n\n| Tiny   | 20 | 18 | +8 to hit, 1d4+4 damage  |   4 |  18 |\n\n| Small  | 25 | 16 | +6 to hit, 1d8+2 damage  |   6 |  14 |\n\n| Medium | 40 | 13 | +5 to hit, 2d6+1 damage  |  10 |  12 |\n\n| Large  | 50 | 10 | +6 to hit, 2d10+2 damage |  14 |  10 |\n\n| Huge   | 80 | 10 | +8 to hit, 2d12+2 damage |  18 |   6 |\n\nAn animated object is a construct with AC, hit points, attacks, Strength, and Dexterity determined by its size. Its Constitution is 10 and its Intelligence and Wisdom are 3, and its Charisma is 1. Its speed is 30 feet; if the object lacks legs or other appendages it can use for locomotion, it instead has a flying speed of 30 feet and can hover. If the object is securely attached to a surface or a larger object, such as a chain bolted to a wall, its speed is 0. It has blindsight with a radius of 30 feet and is blind beyond that distance. When the animated object drops to 0 hit points, it reverts to its original object form, and any remaining damage carries over to its original object form.\n\nIf you command an object to attack, it can make a single melee attack against a creature within 5 feet of it. It makes a slam attack with an attack bonus and bludgeoning damage determined by its size. The GM might rule that a specific object inflicts slashing or piercing damage based on its form.",
        "duration": "Concentration, up to 1 minute",
        "higherLevels": "If you cast this spell using a spell slot of 6th level or higher, you can animate two additional objects for each slot level above 5th.",
        "isCustom": false,
        "isRitual": false,
        "jsonType": "spell",
        "level": 5,
        "name": "Animate Objects",
        "notes": "",
        "pinned": false,
        "prepared": false,
        "range": "120 feet",
        "school": "Transmutation",
        "type": "5th-level transmutation"
      }
    },
    {
      "level": 9,
      "spellModel": {
        "castingTime": "1 action",
        "classes": "fighter, rogue, wizard",
        "components": "V, S, M (a pinch of powder made by crushing a clear gemstone)",
        "description": "An Invisible wall of force springs into existence at a point you choose within range. The wall appears in any orientation you choose, as a horizontal or vertical barrier or at an angle. It can be free floating or Resting on a solid surface. You can form it into a hemispherical dome or a Sphere with a radius of up to 10 feet, or you can shape a flat surface made up of ten 10-foot-by-10-foot panels. Each panel must be contiguous with another panel. In any form, the wall is 1/4 inch thick. It lasts for the Duration. If the wall cuts through a creature's space when it appears, the creature is pushed to one side of the wall (your choice which side).\n\nNothing can physically pass through the wall. It is immune to all damage and can't be dispelled by Dispel Magic. A Disintegrate spell destroys the wall instantly, however. The wall also extends into the Ethereal Plane, blocking ethereal Travel through the wall",
        "duration": "Concentration, up to 10 minutes",
        "higherLevels": "",
        "isCustom": false,
        "isRitual": false,
        "jsonType": "spell",
        "level": 5,
        "name": "Wall of Force",
        "notes": "",
        "pinned": false,
        "prepared": false,
        "range": "120 feet",
        "school": "evocation",
        "type": "5th-level evocation"
      }
    }
  ],
  "subtypes": [],
  "toolProficiencies": [],
  "weaponProficiencies": []
}