{
    "acModifier": "Dexterity",
    "armorProficiencies": [],
    "attacksByLevel": [],
    "baseAc": 10,
    "classWeapon": {
        "abilityName": "Strength",
        "damageType": "Bludgeoning",
        "diceAmount": 1,
        "diceTypeName": "D4",
        "name": ""
    },
    "effectiveCasterLevel": "PARENT",
    "features": [
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "Your body has begun to express your innate magical energies as natural runes that hide beneath your skin. You begin with 1 Essence Rune, and gain an additional rune whenever you gain a level in this class. Runes can manifest anywhere on your body, though the first usually manifests on the forehead. They remain invisible when inert.\n\nAt the end of a turn where you spent any number of sorcery points for any of your class features, an equal number of essence runes glow with stored energy, becoming charged runes. If you expend a charged rune to use one of your Runechild features, it returns to being an inert essence rune.\n\nAs a bonus action, you may spend any number of sorcery points to convert an equal number of essence runes into charged runes. If you have no sorcery points and no charged runes, you can convert a single essence rune into a charged rune as an action.\n\nIf you have 5 or more charged runes, you emit bright light in a 5 foot radius and dim light for an additional 5 feet. Any charged runes revert to inert essence runes after you complete a long rest",
                        "level": 1
                    }
                ],
                "id": "Custom32ea7b18-5ae4-4a2f-bc6f-bd9a3abf1aba",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Essence Runes",
                "notes": "",
                "type": "Feat"
            },
            "level": 1
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "You can release the stored arcane power within your runes to absorb or deflect threatening attacks against you. Whenever you take damage from an attack, hazard, or spell, you can use a reaction to expend any number of charged runes, rolling 1d6 per charged rune. You subtract the total rolled from the damage inflicted by the attack, hazard, or spell",
                        "level": 1
                    },
                    {
                        "description": "You can release the stored arcane power within your runes to absorb or deflect threatening attacks against you. Whenever you take damage from an attack, hazard, or spell, you can use a reaction to expend any number of charged runes, rolling 1d6 per charged rune. You subtract the total rolled from the damage inflicted by the attack, hazard, or spell.\n\nAt 6th level, you can use an action to expend a charged rune, temporarily transferring a Glyph of Aegis to a creature you touch. A creature can only hold a single glyph, and it lasts for 1 hour, or until the creature is damaged by an attack, hazard, or spell. The next time that creature takes damage from any of those sources, roll 1d6 and subtract the number rolled from the damage roll. The glyph is then lost",
                        "level": 6
                    }
                ],
                "id": "Customb47a41dc-8256-40ac-a9da-b13a76f42469",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Glyphs of Aegis",
                "notes": "",
                "type": "Feat"
            },
            "level": 1
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "You can channel your runes to temporarily bolster your physical capabilities. You can expend a charged rune as a bonus action to enhance either your Strength, Dexterity, or Constitution, granting you advantage on ability checks with the chosen ability score until the start of your next turn. You can choose to maintain this benefit additional rounds by expending a charged rune at the start of each of your following turns",
                        "level": 6
                    }
                ],
                "id": "Custom8b9ec250-a6a2-4a5a-99a4-292e8b9d770c",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Sigilic Augmentation",
                "notes": "",
                "type": "Feat"
            },
            "level": 6
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "You can reveal hidden glyphs and enchantments that surround you. As an action, you can expend a charged rune to cause any hidden magical marks, runes, wards, or glyphs within 15 feet of you to reveal themselves with a glow for 1 round. This glow is considered dim light for a 5 foot radius around the mark or glyph",
                        "level": 6
                    }
                ],
                "id": "Customb789f344-1d90-49a1-84aa-2f9148604008",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Manifest Inscriptions",
                "notes": "",
                "type": "Feat"
            },
            "level": 6
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "You can channel your stored runic energy to instill your spells with overwhelming arcane power, bypassing even the staunchest defenses. Whenever you cast a spell, you can expend a number of charged runes equal to the spell’s level to allow it to ignore any resistance or immunity to the spell’s damage type the targets may have",
                        "level": 14
                    }
                ],
                "id": "Customec3da5da-0a25-4437-af98-98d1985da95d",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Runic Torrent",
                "notes": "",
                "type": "Feat"
            },
            "level": 14
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "You can use a bonus action and expend 6 or more charged runes to temporarily become a being of pure magical energy. This new form lasts for 3 rounds plus 1 round for each charged rune expended over 6. While you are in your exemplar form, you gain the following benefits:\n\n- You have a flying speed of 40 feet.\n\n- Your spell save DC is increased by 2.\n\n- You have resistance to damage from spells.\n\n- When you cast a spell of 1st level or higher, you regain hit points equal to the spell’s level. When your Arcane Exemplar form ends, you can’t move or take actions until after your next turn, as your body recovers from the transformation. \n\nOnce you use this feature, you must finish a long rest before you can use it again",
                        "level": 18
                    }
                ],
                "id": "Custom87193233-a415-430c-93a3-bdc3d007adb4",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Arcane Exemplar Form",
                "notes": "",
                "type": "Feat"
            },
            "level": 18
        }
    ],
    "hpModifier": "Constitution",
    "id": "sorcerer_runechild",
    "jsonType": "class",
    "languages": [],
    "modelType": "Archetype",
    "multiclassArmor": true,
    "multiclassSkills": true,
    "multiclassTools": true,
    "multiclassWeapons": true,
    "name": "Runechild",
    "selectableFeatures": [],
    "shouldShowCompanion": false,
    "skillProficiencies": [],
    "specialAbilities": [],
    "spellSlots": [],
    "spellcastingAbility": "Charisma",
    "spells": [],
    "subtypes": [],
    "toolProficiencies": [],
    "weaponProficiencies": []
}