{
  "acModifier": "Dexterity",
  "armorProficiencies": [],
  "attacksByLevel": [],
  "baseAc": 10,
  "classWeapon": {
    "abilityName": "Strength",
    "damageType": "Bludgeoning",
    "diceAmount": 1,
    "diceTypeName": "D4",
    "name": ""
  },
  "effectiveCasterLevel": "PARENT",
  "features": [
    {
      "feat": {
        "descriptionModels": [
          {
            "description": "When you enter your rage, you can transform, revealing the bestial power within you. Until the rage ends, you manifest a natural weapon. It counts as a simple melee weapon for you, and you add your Strength modifier to the attack and damage rolls when you attack with it, as normal.\n\nYou choose the weapon's form each time you rage:\n\n- Bite: Your mouth transforms into a bestial muzzle or great mandibles (your choice). It deals 1d8 piercing damage on a hit. Once on each of your turns when you damage a creature with this bite, you regain a number of hit points equal to your proficiency bonus, provided you have less than half your hit points when you hit.\n\n- Claws: Each of your hands transforms into a claw, which you can use as a weapon if it's empty. It deals 1d6 slashing damage on a hit. Once on each of your turns when you attack with a claw using the Attack action, you can make one additional claw attack as part of the same action.\n\n- Tail: You grow a lashing, spiny tail, which deals 1d8 piercing damage on a hit and has the reach property. If a creature you can see within 10 feet of you hits you with an attack roll, you can use your reaction to swipe your tail and roll a d8, applying a bonus to your AC equal to the number rolled, potentially causing the attack to miss you",
            "level": 3
          }
        ],
        "id": "Customc5fa6143-accd-4ee9-9d92-573919325ea6",
        "isFeature": true,
        "jsonType": "feat",
        "level": 1,
        "name": "Form of the Beast",
        "notes": "",
        "type": "Feat"
      },
      "level": 3
    },
    {
      "feat": {
        "descriptionModels": [
          {
            "description": "The feral power within you increases, causing the natural weapons of your Form of the Beast to count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.\n\nYou can also alter your form to help you adapt to your surroundings. When you finish a short or long rest, choose one of the following benefits, which lasts until you finish your next short or long rest:\n\n- You gain a swimming speed equal to your walking speed, and you can breathe underwater.\n\n- You gain a climbing speed equal to your walking speed, and you can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check.\n\n- When you jump, you can make a Strength (Athletics) check and extend your jump by a number of feet equal to the check's total. You can make this special check only once per turn",
            "level": 6
          }
        ],
        "id": "Customc728f467-43f9-446e-9a68-66ab88de4828",
        "isFeature": true,
        "jsonType": "feat",
        "level": 1,
        "name": "Bestial Soul",
        "notes": "",
        "type": "Feat"
      },
      "level": 6
    },
    {
      "feat": {
        "descriptionModels": [
          {
            "description": "When you hit a creature with your natural weapons while you are raging, the beast within you can curse your target with rabid fury. The target must succeed on a Wisdom saving throw (DC equal to 8 + your Constitution modifier + your proficiency bonus) or suffer one of the following effects (your choice):\n\n- The target must use its reaction to make a melee attack against another creature of your choice that you can see.\n\n- The target takes 2d12 psychic damage.\n\nYou can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest",
            "level": 10
          }
        ],
        "id": "Customd7dd1573-11bd-408b-8e3f-a0f72012c340",
        "isFeature": true,
        "jsonType": "feat",
        "level": 1,
        "name": "Infectious Fury",
        "notes": "",
        "type": "Feat"
      },
      "level": 10
    },
    {
      "feat": {
        "descriptionModels": [
          {
            "description": "When you enter your rage, you can choose a number of other willing creatures you can see within 30 feet of you equal to your Constitution modifier (minimum of one creature).\n\nYou gain 5 temporary hit points for each creature that accepts this feature. Until the rage ends, the chosen creatures can each use the following benefit once on each of their turns: when the creature hits a target with an attack roll and deals damage to it, the creature can roll a d6 and gain a bonus to the damage equal to the number rolled.\n\nYou can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest",
            "level": 14
          }
        ],
        "id": "Customeb1845e8-4be8-41ad-9dd6-626dccd9e89a",
        "isFeature": true,
        "jsonType": "feat",
        "level": 1,
        "name": "Call the Hunt",
        "notes": "",
        "type": "Feat"
      },
      "level": 14
    }
  ],
  "hpModifier": "Constitution",
  "id": "barbarian_path_of_the_beast_[tce]",
  "jsonType": "class",
  "languages": [],
  "modelType": "Archetype",
  "multiclassArmor": true,
  "multiclassSkills": true,
  "multiclassTools": true,
  "multiclassWeapons": true,
  "name": "Path of the Beast [TCE]",
  "selectableFeatures": [],
  "shouldShowCompanion": false,
  "skillProficiencies": [],
  "specialAbilities": [
    {
      "abilityCalculators": [
        {
          "calculators": [
            {
              "operands": [
                {
                  "multiplierConstant": 1,
                  "operator": "PLUS",
                  "stat": "PB"
                }
              ]
            }
          ],
          "level": 10,
          "topLevelConnector": "MAX"
        }
      ],
      "amountsPerLevel": [],
      "associatedValueName": "",
      "id": "4426792f-617a-43bc-9c16-799f7d891808",
      "name": "Infectious Fury Uses",
      "type": "ADVANCED",
      "usesLeft": 0
    },
    {
      "abilityCalculators": [
        {
          "calculators": [
            {
              "operands": [
                {
                  "multiplierConstant": 1,
                  "operator": "PLUS",
                  "stat": "PB"
                }
              ]
            }
          ],
          "level": 14,
          "topLevelConnector": "MAX"
        }
      ],
      "amountsPerLevel": [],
      "associatedValueName": "",
      "id": "15844572-9562-419f-a559-97f398716b0a",
      "name": "Call the Hunt Uses",
      "type": "ADVANCED",
      "usesLeft": 0
    }
  ],
  "spellSlots": [],
  "spellcastingAbility": "Intelligence",
  "spells": [],
  "subtypes": [],
  "toolProficiencies": [],
  "unarmoredDefense": "Constitution",
  "weaponProficiencies": []
}