{
    "acModifier": "Dexterity",
    "armorProficiencies": [],
    "attacksByLevel": [],
    "baseAc": 10,
    "classWeapon": {
        "abilityName": "Strength",
        "damageType": "Bludgeoning",
        "diceAmount": 1,
        "diceTypeName": "D4",
        "name": ""
    },
    "effectiveCasterLevel": "PARENT",
    "features": [
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "Your body reacts to the presence of magic. You can cast the detect magic spell without using a spell slot or components. Constitution is your spellcasting ability for this spell. You faintly glow a color corresponding to the school of magic you detect (you choose the colors).\nYou can use this feature a number of times \r equal to your Constitution modifier (minimum of once). You regain all expended uses when you finish a long rest",
                        "level": 3
                    }
                ],
                "id": "Customb8482245-1264-44db-ae64-d0e6c0a26ec0",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Lingering Magic",
                "notes": "",
                "type": "Feat"
            },
            "level": 3
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "Magic erupts from you as you rage. When you enter your rage, roll on the Wild Surge table to determine the magical effect produced. \r\nIf the wild surge requires a saving throw, the DC equals 8 + your proficiency bonus + your Constitution modifier",
                        "level": 3
                    }
                ],
                "id": "Custom2b2a31a9-6683-4b97-b88b-1d68de81c5a7",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Wild Surge",
                "notes": "",
                "type": "Feat"
            },
            "level": 3
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "d8 --> effect\n\n1 --> Necrotic energy bursts from you. Each creature within 30 feet of you takes 1d10 necrotic damage, and you gain temporary hit points equal to the sum of the necrotic damage dealt to the creatures. \r\n\n2 --> You teleport up to 20 feet to an unoccupied space you can see. Until your rage ends, you can activate this effect again on each of your turns as a bonus action. \r\n\n3 --> You conjure 1d4 intangible spirits that look like flumphs in unoccupied spaces within 30 feet of you. Each spirit immediately flies 30 feet in a random direction. At the end of your turn, all spirits explode and each creature within 5 feet of one or more of them must succeed on a Dexterity saving throw or take 2d8 force damage. \r\n\n4 --> Arcane energy enshrouds you. Until your rage ends, you gain a +2 bonus to AC, and whenever a creature within 10 feet of you hits you with an attack, that creature takes force damage equal to your Constitution modifier. \r\n\n5 --> Plant life temporarily grows around you: until your rage ends, the ground within 10 feet of you is difficult terrain. \r\n\n6 --> Arcane energy taps into the minds of those around you. Each creature within 30 feet of you must succeed on a Wisdom saving throw or you see a glimpse of the creature’s thoughts, learning how it plans to attack you. As a result, the creature has disadvantage on attack rolls against you until the start of your next turn\n\n7 --> Shadows weave around a weapon of your choice you are holding. Until your rage ends, your weapon deals psychic damage instead of its bludgeoning, slashing, or piercing damage, and it gains the light and thrown properties with a normal range of 20 feet and a long range of 60 feet. If you drop the weapon or throw it, the weapon dissipates and reappears in your hand at the end of your turn. \r\n\n8 --> A beam of brilliant light lances from your chest in a 5-foot-wide, 60-foot-long line. Each creature in the line must succeed on a Constitution saving throw or take 2d8 radiant damage and be blinded until the start of your next turn",
                        "level": 3
                    }
                ],
                "id": "Customac70e181-fd66-4ec7-ab76-7f8908d720c2",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Wild Surge Table",
                "notes": "",
                "type": "Feat"
            },
            "level": 3
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "You can channel the magic surging inside you into other creatures. As an action, you can touch a creature and roll a d4. The creature recovers an expended spell slot of a level equal to the number rolled. If the creature you touch can’t recover a spell slot of that level, the creature instead gains temporary hit points equal to five times the number rolled. You take force damage equal to five times the number rolled. \r",
                        "level": 6
                    },
                    {
                        "description": "You can channel the magic surging inside you into other creatures. As an action, you can touch a creature and roll a d6. The creature recovers an expended spell slot of a level equal to the number rolled. If the creature you touch can’t recover a spell slot of that level, the creature instead gains temporary hit points equal to five times the number rolled. You take force damage equal to five times the number rolled.",
                        "level": 14
                    }
                ],
                "id": "Custom5e4358b7-e840-4d4a-b05c-094cec3e68cd",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Magic Reserves",
                "notes": "",
                "type": "Feat"
            },
            "level": 6
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "The magic crackling within your soul lashes out. When a creature forces you to make a saving throw while you are raging, you can use your reaction to deal 3d6 force damage to that creature",
                        "level": 10
                    }
                ],
                "id": "Custom30bc7bf8-a889-45fd-b512-29b6d11e52a7",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Arcane Rebuke",
                "notes": "",
                "type": "Feat"
            },
            "level": 10
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "You become a wellspring of wild magic while you are raging. As a bonus action, you can reroll on the Wild Surge table, replacing your current effect with the new one",
                        "level": 14
                    }
                ],
                "id": "Custome02c43c9-3147-4749-a3ac-a630819ba947",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Chaotic Fury",
                "notes": "",
                "type": "Feat"
            },
            "level": 14
        }
    ],
    "hpModifier": "Constitution",
    "id": "barbarian_path_of_the_wild_soul",
    "jsonType": "class",
    "languages": [],
    "modelType": "Archetype",
    "multiclassArmor": true,
    "multiclassSkills": true,
    "multiclassTools": true,
    "multiclassWeapons": true,
    "name": "Path of the Wild Soul",
    "selectableFeatures": [],
    "shouldShowCompanion": false,
    "skillProficiencies": [],
    "specialAbilities": [],
    "spellSlots": [],
    "spellcastingAbility": "Intelligence",
    "spells": [],
    "subtypes": [],
    "toolProficiencies": [],
    "unarmoredDefense": "Constitution",
    "weaponProficiencies": []
}