{
    "acModifier": "Dexterity",
    "armorProficiencies": [],
    "attacksByLevel": [],
    "baseAc": 10,
    "classWeapon": {
        "abilityName": "Strength",
        "damageType": "Bludgeoning",
        "diceAmount": 1,
        "diceTypeName": "D4",
        "name": ""
    },
    "effectiveCasterLevel": "PARENT",
    "features": [
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "You can open your awareness to the presence of concentrated magic. Until the end of your next turn, you know the location of any spell or magic item within 60 feet of you that isn't behind total cover. When you sense a spell, you learn which school of magic it belongs to.\n\nYou can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest",
                        "level": 3
                    }
                ],
                "id": "Custom093ff588-efea-4d09-b6bc-1b419b6a5710",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Magic Awareness",
                "notes": "",
                "type": "Feat"
            },
            "level": 3
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "When you enter your rage, roll on the Wild Magic table to determine the magical effect produced.\n\nIf the effect requires a saving throw, the DC equals 8 + your proficiency bonus + your Constitution modifier.\n\nd8 --> Magical Effect\n\n1 -->Shadowy tendrils lash around you. Each creature of your choice that you can see within 30 feet of you must succeed on a Constitution saving throw or take 1d12 necrotic damage. You also gain 1d12 temporary hit points.\n\n2 --> You teleport up to 30 feet to an unoccupied space you can see. Until your rage ends, you can use this effect again on each of your turns as a bonus action.\n\n3 --> An intangible spirit, which looks like a flumph or a pixie (your choice), appears within 5 feet of one creature of your choice that you can see within 30 feet of you. At the end of the current turn, the spirit explodes, and each creature within 5 feet of it must succeed on a Dexterity saving throw or take 1d6 force damage. Until your rage ends, you can use this effect again, summoning another spirit, on each of your turns as a bonus action.\n\n4 --> Magic infuses one weapon of your choice that you are holding. Until your rage ends, the weapon's damage type changes to force, and it gains the light and thrown properties, with a normal range of 20 feet and a long range of 60 feet. If the weapon leaves your hand, the weapon reappears in your hand at the end of the current turn.\n\n5 --> Whenever a creature hits you with an attack roll before your rage ends, that creature takes 1d6 force damage, as magic lashes out in retribution.\n\n6 --> Until your rage ends, you are surrounded by multi colored, protective lights. You gain a +1 bonus to AC, and while within 10 feet of you, your allies gain the same bonus.\n\n7 --> Flowers and vines temporarily grow around you. Until your rage ends, the ground within 15 feet of you is difficult terrain for your enemies.\n\n8 --> A bolt of light shoots from your chest. Another creature of your choice that you can see within 30 feet of you must succeed on a Constitution saving throw or take 1d6 radiant damage and be blinded until the start of your next turn. Until your rage ends, you can use this effect again on each of your turns as a bonus action.",
                        "level": 3
                    }
                ],
                "id": "Custom76fe92d2-b5f7-40a7-a379-a83a54725654",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Wild Surge",
                "notes": "",
                "type": "Feat"
            },
            "level": 3
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "As an action, you can touch one creature (which can be yourself) and confer one of the following benefits of your choice to that creature:\n\n- For 10 minutes, the creature can roll a d3 whenever making an attack roll or an ability check and add the number rolled to the d20 roll.\n\n- Roll a d3. The creature regains one expended spell slot, the level of which equals the number rolled or lower (the creature's choice). Once a creature receives this benefit, that creature can't receive it again until after a long rest.\nYou can take this action a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest",
                        "level": 6
                    }
                ],
                "id": "Customc9c5d026-ca9d-4abc-a3c4-38fc8a01df65",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Bolstering Magic",
                "notes": "",
                "type": "Feat"
            },
            "level": 6
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "When you are imperiled during your rage, the magic within you can lash out; immediately after you take damage or fail a saving throw while raging, you can use your reaction to roll on the Wild Magic table and immediately produce the effect rolled. This effect replaces your current Wild Magic effect",
                        "level": 10
                    }
                ],
                "id": "Custom50e471a1-e659-4ba5-8a15-4baeec3019df",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Unstable Backlash",
                "notes": "",
                "type": "Feat"
            },
            "level": 10
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "Whenever you roll on the Wild Magic table, you can roll the die twice and choose which of the two effects to unleash. If you roll the same number on both dice, you can ignore the number and choose any effect on the table",
                        "level": 14
                    }
                ],
                "id": "Customa9ad0bd6-28cc-4482-9599-1e6bb6fd3c69",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Controlled Surge",
                "notes": "",
                "type": "Feat"
            },
            "level": 14
        }
    ],
    "hpModifier": "Constitution",
    "id": "barbarian_path_of_wild_magic_[tce]",
    "jsonType": "class",
    "languages": [],
    "modelType": "Archetype",
    "multiclassArmor": true,
    "multiclassSkills": true,
    "multiclassTools": true,
    "multiclassWeapons": true,
    "name": "Path of Wild Magic [TCE]",
    "selectableFeatures": [],
    "shouldShowCompanion": false,
    "skillProficiencies": [],
    "specialAbilities": [
        {
            "abilityCalculators": [
                {
                    "calculators": [
                        {
                            "operands": [
                                {
                                    "multiplierConstant": 1,
                                    "operator": "PLUS",
                                    "stat": "PB"
                                }
                            ]
                        }
                    ],
                    "level": 3,
                    "topLevelConnector": "MAX"
                }
            ],
            "amountsPerLevel": [],
            "associatedValueName": "",
            "id": "2bbab8e1-fca4-4d8e-ba84-c5dd025dbf1d",
            "name": "Magic Awareness Uses",
            "type": "ADVANCED",
            "usesLeft": 0
        },
        {
            "abilityCalculators": [
                {
                    "calculators": [
                        {
                            "operands": [
                                {
                                    "multiplierConstant": 1,
                                    "operator": "PLUS",
                                    "stat": "PB"
                                }
                            ]
                        }
                    ],
                    "level": 6,
                    "topLevelConnector": "MAX"
                }
            ],
            "amountsPerLevel": [],
            "associatedValueName": "",
            "id": "9a2d2a44-d730-4aea-8371-6e8b56dbc309",
            "name": "Bolstering Magic Uses",
            "type": "ADVANCED",
            "usesLeft": 0
        }
    ],
    "spellSlots": [],
    "spellcastingAbility": "Intelligence",
    "spells": [],
    "subtypes": [],
    "toolProficiencies": [],
    "unarmoredDefense": "Constitution",
    "weaponProficiencies": []
}