{
    "acModifier": "Dexterity",
    "armorProficiencies": [],
    "attacksByLevel": [],
    "baseAc": 10,
    "classWeapon": {
        "abilityName": "Strength",
        "damageType": "Bludgeoning",
        "diceAmount": 1,
        "diceTypeName": "D4",
        "name": ""
    },
    "effectiveCasterLevel": "PARENT",
    "features": [
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "You gain the following benefits:\n\n- Thaumaturgy: You learn the thaumaturgy cantrip, which is a ranger spell for you.\n\n- Tongue of Dragons: You learn to speak, read, and write Draconic or one other language of your choice",
                        "level": 3
                    }
                ],
                "id": "Custom3aab0260-4882-4568-a562-5821bb54c52e",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Draconic Gift",
                "notes": "",
                "type": "Feat"
            },
            "level": 3
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "As an action, you can magically summon the drake that is bound to you. It appears in an unoccupied space of your choice within 30 feet of you.\n\nThe drake is friendly to you and your companions, and it obeys your commands. See its game statistics in the accompanying Drake Companion stat block, which uses your proficiency bonus (PB) in several places. Whenever you summon the drake, choose a damage type listed in its Draconic Essence trait. You can determine the cosmetic characteristics of the drake, such as its color, its scale texture, or any visible effect of its Draconic Essence; your choice has no effect on its game statistics.\n\nIn combat, the drake shares your initiative count, but it takes its turn immediately after yours. It can move and use its reaction on its own, but the only action it takes on its turn is the Dodge action, unless you take a bonus action on your turn to command it to take another action. That action can be one in its stat block or some other action. If you are incapacitated, the drake can take any action of its choice, not just Dodge.\n\nThe drake remains until it is reduced to 0 hit points, until you use this feature to summon the drake again, or until you die. Anything the drake was wearing or carrying is left behind when the drake vanishes.\n\nOnce you summon the drake, you can't do so again until you finish a long rest, unless you expend a spell slot of 1st level or higher to summon it",
                        "level": 3
                    }
                ],
                "id": "Custom5619bb71-ca12-4494-9003-cc47beb8fdf3",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Drake Companion",
                "notes": "",
                "type": "Feat"
            },
            "level": 3
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "When you summon your drake, it grows wings on its back and gains a flying speed equal to its walking speed.\n\nIn addition, while your drake is summoned, you and the drake gain the following benefits:\n\n- Drake Mount: The drake grows to Medium size. Reflecting your special bond, you can use the drake as a mount if your size is Medium or smaller. While you are riding your drake, it can't use the flying speed of this feature.\n\n- Magic Fang: The drake's Bite attack deals an extra 1d6 damage of the type chosen for the drake's Draconic Essence.\n\n- Resistance: You gain resistance to the damage type chosen for the drake's Draconic Essence",
                        "level": 7
                    }
                ],
                "id": "Custom139d7efc-352e-4953-b130-68100124460f",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Bond of Fang and Scale",
                "notes": "",
                "type": "Feat"
            },
            "level": 7
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "As an action, you can exhale a 30-foot cone of damaging breath or cause your drake to exhale it. Choose acid, cold, fire, lightning, or poison damage (your choice doesn't have to match your drake's Draconic Essence). Each creature in the cone must make a Dexterity saving throw against your spell save DC, taking 8d6 damage on a failed save, or half as much damage on a successful one.\n\nOnce you use this feature, you can't do so again until you finish a long rest, unless you expend a spell slot of 3rd level or higher to use it again",
                        "level": 11
                    },
                    {
                        "description": "As an action, you can exhale a 30-foot cone of damaging breath or cause your drake to exhale it. Choose acid, cold, fire, lightning, or poison damage (your choice doesn't have to match your drake's Draconic Essence). Each creature in the cone must make a Dexterity saving throw against your spell save DC, taking 10d6 damage on a failed save, or half as much damage on a successful one.\n\nOnce you use this feature, you can't do so again until you finish a long rest, unless you expend a spell slot of 3rd level or higher to use it again",
                        "level": 15
                    }
                ],
                "id": "Customa519c7b5-092f-4fd0-b72e-2681291405cb",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Drake's Breath",
                "notes": "",
                "type": "Feat"
            },
            "level": 11
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "While your drake is summoned, you and the drake gain the following benefits:\n\n- Empowered Bite: The drake's Bite attack deals an extra 1d6 damage of the type chosen for its Draconic Essence (for a total of 2d6 extra damage).\n\n- Large Drake: The drake grows to Large size. When you ride your drake, it is no longer prohibited from using the flying speed of Bond of Fang and Scale.\n\n- Reflexive Resistance: When either you or the drake takes damage while you're within 30 feet of each other, you can use your reaction to give yourself or the drake resistance to that instance of damage. You can use this reaction a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest",
                        "level": 15
                    }
                ],
                "id": "Custom24094eaa-5b04-49d1-afc0-b893a2ed997f",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Perfected Bond",
                "notes": "",
                "type": "Feat"
            },
            "level": 15
        }
    ],
    "hpModifier": "Constitution",
    "id": "ranger_drakewarden_[ftd]",
    "jsonType": "class",
    "languages": [
        {
            "hint": "",
            "level": 3,
            "proficiency": "Draconic"
        }
    ],
    "modelType": "Archetype",
    "multiclassArmor": true,
    "multiclassSkills": true,
    "multiclassTools": true,
    "multiclassWeapons": true,
    "name": "Drakewarden [FTD]",
    "selectableFeatures": [],
    "shouldShowCompanion": true,
    "skillProficiencies": [],
    "specialAbilities": [
        {
            "abilityCalculators": [],
            "amountsPerLevel": [
                {
                    "amount": 1,
                    "level": 3
                }
            ],
            "associatedValueName": "",
            "id": "b610e83a-773c-46fd-b3c5-c0a4e3a5ac67",
            "name": "Drake Summons",
            "type": "BASIC",
            "usesLeft": 0
        },
        {
            "abilityCalculators": [],
            "amountsPerLevel": [
                {
                    "amount": 1,
                    "level": 11
                }
            ],
            "associatedValueName": "",
            "id": "61ac4b9c-20f8-4ff4-a9a6-94fa661477b5",
            "name": "Drake's Breath Uses",
            "type": "BASIC",
            "usesLeft": 0
        },
        {
            "abilityCalculators": [
                {
                    "calculators": [
                        {
                            "operands": [
                                {
                                    "multiplierConstant": 1,
                                    "operator": "PLUS",
                                    "stat": "PB"
                                }
                            ]
                        }
                    ],
                    "level": 15,
                    "topLevelConnector": "MAX"
                }
            ],
            "amountsPerLevel": [],
            "associatedValueName": "",
            "id": "1ad4b147-904b-44eb-8596-e0fb5214f954",
            "name": "Reflexive Resistance Uses",
            "type": "ADVANCED",
            "usesLeft": 0
        }
    ],
    "spellSlots": [],
    "spellcastingAbility": "Wisdom",
    "spells": [
        {
            "level": 3,
            "spellModel": {
                "castingTime": "1 action",
                "classes": "cleric",
                "components": "V",
                "description": "* Your voice booms up to three times as loud as normal for 1 minute.\n\n* You cause flames to flicker, brighten, dim, or change color for 1 minute.\n\n* You cause harmless tremors in the ground for 1 minute.\n\n* You create an instantaneous sound that originates from a point of your choice within range, such as a rumble of thunder, the cry of a raven, or ominous whispers.\n\n* You instantaneously cause an unlocked door or window to fly open or slam shut.\n\n* You alter the appearance of your eyes for 1 minute.\n\nIf you cast this spell multiple times, you can have up to three of its 1-minute effects active at a time, and you can dismiss such an effect as an action.",
                "duration": "Up to 1 minute",
                "higherLevels": "",
                "isCustom": false,
                "isRitual": false,
                "jsonType": "spell",
                "level": 0,
                "name": "Thaumaturgy",
                "notes": "",
                "pinned": false,
                "prepared": false,
                "range": "30 feet",
                "school": "Transmutation",
                "type": "Transmutation cantrip"
            }
        }
    ],
    "subtypes": [],
    "toolProficiencies": [],
    "weaponProficiencies": []
}