{
  "acModifier": "Dexterity",
  "armorProficiencies": [],
  "attacksByLevel": [],
  "baseAc": 10,
  "classWeapon": {
    "abilityName": "Strength",
    "damageType": "Bludgeoning",
    "diceAmount": 1,
    "diceTypeName": "D4",
    "name": ""
  },
  "effectiveCasterLevel": "PARENT",
  "features": [
    {
      "feat": {
        "descriptionModels": [
          {
            "description": "Your proficiency bonus is doubled for any ability check you make that uses the Arcana, History, Nature, or Religion skill if you are proficient in that skill.\n\nIn addition, when you roll initiative, it is either an Intelligence check or a Dexterity check for you (your choice)",
            "level": 2
          }
        ],
        "id": "Customf8e60468-a2a4-4153-9eb3-f7f475c0ec4d",
        "isFeature": true,
        "jsonType": "feat",
        "level": 1,
        "name": "Lore Master",
        "notes": "",
        "type": "Feat"
      },
      "level": 2
    },
    {
      "feat": {
        "descriptionModels": [
          {
            "description": "When you cast a spell with a spell slot and the spell deals acid, cold, fire, force, lightning, necrotic, radiant, or thunder damage, you can substitute that damage type with one other type from that list (you can change only one damage type per casting of a spell). You replace one energy type for another by altering the spell's formula as you cast it.\n\nWhen you cast a spell with a spell slot and the spell requires a saving throw, you can change the saving throw from one ability score to another of your choice. Once you change a saving throw in this way, you can't do so again until you finish a short or long rest",
            "level": 2
          }
        ],
        "id": "Customfd7ef6f0-5161-413c-a578-3177afb092be",
        "isFeature": true,
        "jsonType": "feat",
        "level": 1,
        "name": "Spell Secrets",
        "notes": "",
        "type": "Feat"
      },
      "level": 2
    },
    {
      "feat": {
        "descriptionModels": [
          {
            "description": "When you cast a spell with a spell slot, you can expend one additional spell slot to augment its effects for this casting. The effect depends on the spell slot you expend.\n\nAn additional 1st-level spell slot can increase the spell's raw force. If you roll damage for the spell when you cast it, increase the damage against every target by 2d10 force damage. If the spell can deal damage on more than one turn, it deals this extra force damage only on the turn you cast the spell.\n\nAn additional 2nd-level spell slot can increase the spell's range. If the spell's range is at least 30 feet, it becomes 1 mile.\n\nAn additional 3rd-level spell slot can increase the spell's potency. Increase the spell's save DC by 2",
            "level": 6
          }
        ],
        "id": "Customcd97d0fd-b31b-493d-91ed-e3a8ee9d9104",
        "isFeature": true,
        "jsonType": "feat",
        "level": 1,
        "name": "Alchemical Casting",
        "notes": "",
        "type": "Feat"
      },
      "level": 6
    },
    {
      "feat": {
        "descriptionModels": [
          {
            "description": "As a bonus action, you can replace one spell you have prepared with another spell from your spellbook. You can't use this feature again until you finish a short or long rest",
            "level": 10
          }
        ],
        "id": "Customcc69b025-c921-47fc-a2b3-f2ed5f30cd5f",
        "isFeature": true,
        "jsonType": "feat",
        "level": 1,
        "name": "Prodigious Memory",
        "notes": "",
        "type": "Feat"
      },
      "level": 10
    },
    {
      "feat": {
        "descriptionModels": [
          {
            "description": "As a bonus action, you can call to mind the ability to cast one spell of your choice from any class's spell list. The spell must be of a level for which you have spell slots, you mustn't have it prepared, and you follow the normal rules for casting it, including expending a spell slot. If the spell isn't a wizard spell, it counts as a wizard spell when you cast it. The ability to cast the spell vanishes from your mind when you cast it or when the current turn ends.\n\nYou can't use this feature again until you finish a long rest",
            "level": 14
          }
        ],
        "id": "Custombc0bfe57-669b-426f-8fdb-281d14c8671e",
        "isFeature": true,
        "jsonType": "feat",
        "level": 1,
        "name": "Master of Magic",
        "notes": "",
        "type": "Feat"
      },
      "level": 14
    }
  ],
  "hpModifier": "Constitution",
  "id": "wizard_lore_mastery",
  "jsonType": "class",
  "languages": [],
  "modelType": "Archetype",
  "multiclassArmor": true,
  "multiclassSkills": true,
  "multiclassTools": true,
  "multiclassWeapons": true,
  "name": "Lore Mastery",
  "selectableFeatures": [],
  "shouldShowCompanion": false,
  "skillProficiencies": [],
  "specialAbilities": [],
  "spellSlots": [],
  "spellcastingAbility": "Intelligence",
  "spells": [],
  "subtypes": [],
  "toolProficiencies": [],
  "weaponProficiencies": []
}