{
    "acModifier": "Dexterity",
    "armorProficiencies": [],
    "attacksByLevel": [],
    "baseAc": 10,
    "classWeapon": {
        "abilityName": "Strength",
        "damageType": "Bludgeoning",
        "diceAmount": 1,
        "diceTypeName": "D4",
        "name": ""
    },
    "effectiveCasterLevel": "PARENT",
    "features": [
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "The gold and time you must spend to copy a transmutation spell into your spellbook is halved",
                        "level": 2
                    }
                ],
                "id": "Customfa0f9338-e42c-4468-9c2a-14ac10c5caeb",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Transmutation Savant",
                "notes": "",
                "type": "Feat"
            },
            "level": 2
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "You can temporarily alter the physical properties of one nonmagical object, changing it from one substance into another. You perform a special alchemical procedure on one object composed entirely of wood, stone (but not a gemstone), iron, copper, or silver, transforming it into a different one of those materials. For each 10 minutes you spend performing the procedure, you can transform up to 1 cubic foot of material. After 1 hour, or until you lose your concentration (as if you were concentrating on a spell), the material reverts to its original substance",
                        "level": 2
                    }
                ],
                "id": "Customb22f0646-6d0b-453c-90ad-0a9116eb5d23",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Minor Alchemy",
                "notes": "",
                "type": "Feat"
            },
            "level": 2
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "You can spend 8 hours creating a transmuter's stone that stores transmutation magic. You can benefit from the stone yourself or give it to another creature. A creature gains a benefit of your choice as long as the stone is in the creature's possession. When you create the stone, choose the benefit from the following options:\n\n- Darkvision out to a range of 60 feet.\n- An increase to speed of 10 feet while the creature is unencumbered\n- Proficiency in Constitution saving throws\nResistance to acid, cold, fire, lightning, or thunder damage (your choice whenever you choose this benefit)\n- Each time you cast a transmutation spell of 1st level or higher, you can change the effect of your stone if the stone is on your person.\n\nIf you create a new transmuter's stone, the previous one ceases to function",
                        "level": 6
                    }
                ],
                "id": "Customff2c6ff7-6c35-46e7-adb9-c6e1a093bf9d",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Transmuter's Stone",
                "notes": "",
                "type": "Feat"
            },
            "level": 6
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "You add the polymorph spell to your spellbook, if it is not there already. You can cast Polymorph without expending a spell slot. When you do so, you can target only yourself and transform into a beast whose challenge rating is 1 or lower.\n\nOnce you cast Polymorph in this way, you can't do so again until you finish a short or long rest, though you can still cast it normally using an available spell slot",
                        "level": 10
                    }
                ],
                "id": "Custom6f71a81f-2f61-4a7a-a4ac-853d699c71f9",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Shapechanger",
                "notes": "",
                "type": "Feat"
            },
            "level": 10
        },
        {
            "feat": {
                "descriptionModels": [
                    {
                        "description": "You can use your action to consume the reserve of transmutation magic stored within your transmuter's stone in a single burst. When you do so, choose one of the following effects. Your transmuter's stone is destroyed and can't be remade until you finish a long rest.\n\n- Major Transformation: You can transmute one nonmagical object—no larger than a 5—foot cube into another nonmagical object of similar size and mass and of equal or lesser value. You must spend 10 minutes handling the object to transform it.\n\n- Panacea: You remove all curses, diseases, and poisons affecting a creature that you touch with the transmuter's stone. The creature also regains all its hit points.\n\n- Restore Life: You cast the Raise Dead spell on a creature you touch with the transmuter's stone, without expending a spell slot or needing to have the spell in your spellbook.\n\n- Restore Youth: You touch the transmuter's stone to a willing creature, and that creature's apparent age is reduced by 3d10 years, to a minimum of 13 years. This effect doesn't extend the creature's lifespan",
                        "level": 14
                    }
                ],
                "id": "Custombd53d47c-8168-4a5e-bf91-5e9e48176ddf",
                "isFeature": true,
                "jsonType": "feat",
                "level": 1,
                "name": "Master Transmuter",
                "notes": "",
                "type": "Feat"
            },
            "level": 14
        }
    ],
    "hpModifier": "Constitution",
    "id": "wizard_school_of_transmutation",
    "jsonType": "class",
    "languages": [],
    "modelType": "Archetype",
    "multiclassArmor": true,
    "multiclassSkills": true,
    "multiclassTools": true,
    "multiclassWeapons": true,
    "name": "School of Transmutation",
    "selectableFeatures": [],
    "shouldShowCompanion": false,
    "skillProficiencies": [],
    "specialAbilities": [],
    "spellSlots": [],
    "spellcastingAbility": "Intelligence",
    "spells": [
        {
            "level": 10,
            "spellModel": {
                "castingTime": "1 action",
                "classes": "bard, druid, sorcerer, fighter, rogue, wizard",
                "components": "V, S, M (a caterpillar cocoon)",
                "description": "This spell transforms a creature that you can see within range into a new form. An unwilling creature must make a Wisdom saving throw to avoid the effect. A shapechanger automatically succeeds on this saving throw.\n\nThe transformation lasts for the duration, or until the target drops to 0 hit points or dies. The new form can be any beast whose challenge rating is equal to or less than the target's (or the target's level, if it doesn’t have a challenge rating). The target's game statistics, including mental ability scores, are replaced by the statistics of the chosen beast. It retains its alignment and personality.\n\nThe target assumes the hit points of its new form. When it reverts to its normal form, the creature returns to the number of hit points it had before it transformed. If it reverts as a result of dropping to 0 hit points, any excess damage carries over to its normal form.\n\nAs long as the excess damage doesn't reduce the creature's normal form to 0 hit points, it isn't knocked unconscious.\n\nThe creature is limited in the actions it can perform by the nature of its new form, and it can't speak, cast spells, or take any other action that requires hands or speech.\n\nThe target's gear melds into the new form. The creature can't activate, use, wield, or otherwise benefit from any of its equipment.",
                "duration": "Concentration, up to 1 hour",
                "higherLevels": "",
                "isCustom": false,
                "isRitual": false,
                "jsonType": "spell",
                "level": 4,
                "name": "Polymorph",
                "notes": "",
                "pinned": false,
                "prepared": false,
                "range": "60 feet",
                "school": "transmutation",
                "type": "4th-level transmutation"
            }
        }
    ],
    "subtypes": [],
    "toolProficiencies": [],
    "weaponProficiencies": []
}